[{"joke_id":"RE5tz52q","USF1000_rating":1.0,"USF1001_rating":8.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tz52q","jokeText":"I hate how you cant even say black paint anymore\nNow I have to say \"Leroy can you please paint the fence?\""},{"joke_id":"RE5tz4dd","USF1000_rating":1.0,"USF1001_rating":8.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tz4dd","jokeText":"What's the difference between a Jew in Nazi Germany and pizza ?\nPizza doesn't scream when you put it in the oven .\n\nI'm so sorry."},{"joke_id":"RE5tz319","USF1000_rating":0.0,"USF1001_rating":9.0,"USF1002_rating":8.0,"source":"reddit","datasource_joke_id":"5tz319","jokeText":"I recently went to America....\n...and being there really helped me learn about American culture. So I visited a shop and as I was leaving, the Shopkeeper said \"Have a nice day!\" But I didn't so I sued him."},{"joke_id":"RE5tz2wj","USF1000_rating":3.0,"USF1001_rating":9.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tz2wj","jokeText":"Brian raises his hand and says, “He’s in Heaven.”\nA Sunday school teacher is concerned that his students might be a little confused about Jesus, so he asks his class, “Where is Jesus today?”\nBrian raises his hand and says, “He’s in Heaven.”\n\nSusan answers, “He’s in my heart.”\n\nLittle Johnny waves his hand furiously and blurts out, “He’s in our bathroom!”\n\nThe teacher is surprised by this answer and asks Little Johnny how he knows this.\n\n“Well,” Little Johnny says, “every morning, my Dad gets up, bangs on the bathroom door and yells ‘Jesus Christ, are you still in there?'”"},{"joke_id":"RE5tz1pc","USF1000_rating":5.0,"USF1001_rating":3.0,"USF1002_rating":8.0,"source":"reddit","datasource_joke_id":"5tz1pc","jokeText":"You hear about the University book store worker who was charged for stealing $20,000 worth of books?\nHe got caught trying to sell the two books to a freshman."},{"joke_id":"RE5tz1o1","USF1000_rating":4.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tz1o1","jokeText":"Why is it unknown on how pterodactyls urinate especially during flight?\nBecause the p is silent."},{"joke_id":"RE5tz0ef","USF1000_rating":0.0,"USF1001_rating":7.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tz0ef","jokeText":"Why women need legs?\nTo avoid leaving tracks like a snail while walking."},{"joke_id":"RE5tz04j","USF1000_rating":2.0,"USF1001_rating":5.0,"USF1002_rating":9.0,"source":"reddit","datasource_joke_id":"5tz04j","jokeText":"I walked into a PETA adoption center and the receptionist asked me what kind of dog I wanted\nApparently \"Whatever's low in cholesterol\" was not the right answer."},{"joke_id":"RE5tz02q","USF1000_rating":3.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tz02q","jokeText":"How did TV studios make words appear on screen before computers?\nCharacter actors!"},{"joke_id":"RE5tz02h","USF1000_rating":0.0,"USF1001_rating":7.0,"USF1002_rating":3.0,"source":"reddit","datasource_joke_id":"5tz02h","jokeText":"How do you find Will Smith in the snow?\nYou follow his fresh prints. "},{"joke_id":"RE5tyzxh","USF1000_rating":2.0,"USF1001_rating":7.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyzxh","jokeText":"Remember when you were a kid and when you cried your parents said, \"I'll give you a reason to cry\"?\nI always thought they were gunna hit me, not that they were going to destroy the housing market 20 years later."},{"joke_id":"RE5tyzx4","USF1000_rating":4.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyzx4","jokeText":"Remember, you can't spell Valentine's Day without...\n... Anal Destiny."},{"joke_id":"RE5tyze2","USF1000_rating":3.0,"USF1001_rating":0.0,"USF1002_rating":9.0,"source":"reddit","datasource_joke_id":"5tyze2","jokeText":"Happy try not to jump off a bridge day!\nOh and it's also Valentines day"},{"joke_id":"RE5tyytx","USF1000_rating":2.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyytx","jokeText":"My boss said to me, \"you're the worst train driver ever. How many have you derailed this year?\"\nI said, \"I'm not sure; it's hard to keep track.\""},{"joke_id":"RE5tyyo2","USF1000_rating":1.0,"USF1001_rating":1.0,"USF1002_rating":9.0,"source":"reddit","datasource_joke_id":"5tyyo2","jokeText":"If I get a bird I'm naming it Trump\ncuz all they do is Tweet"},{"joke_id":"RE5tyxrb","USF1000_rating":0.0,"USF1001_rating":6.0,"USF1002_rating":6.0,"source":"reddit","datasource_joke_id":"5tyxrb","jokeText":"I was going to get a headjob for Valentines Day\nBut my back was sore and I couldn't reach."},{"joke_id":"RE5tyx6v","USF1000_rating":4.0,"USF1001_rating":6.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyx6v","jokeText":"A mother went into a coma after giving birth to twins\nWhen she woke up after 6 months and 3 days, the doctor told the mother: \"While you were in a coma, we had your brother name your children. One is a boy, one is a girl.\"\n\nThe mother, with a disappointed and angry look on her face told the doctor: \"Why my brother? That guy is an idiot. So what did he name them?\"\n\nThe mother, expecting hideous names, prepared herself.\n\n\"The girl, was named Denise.\" The mother thought, \"Hey that wasn't so bad. What about my boy?\"\n\nThe doctor said, \"Denephew\"."},{"joke_id":"RE5tywci","USF1000_rating":1.0,"USF1001_rating":0.0,"USF1002_rating":1.0,"source":"reddit","datasource_joke_id":"5tywci","jokeText":"What do you call an exercise machine with a strobe light?\nAn epileptical. "},{"joke_id":"RE5tyt6c","USF1000_rating":4.0,"USF1001_rating":9.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyt6c","jokeText":"My dad has a heart of a lion\n...and a lifetime ban from the local zoo. "},{"joke_id":"RE5tyqqw","USF1000_rating":1.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyqqw","jokeText":"Smaller babies may be delivered by a stork.\nBut the bigger, heavier ones are delivered by a crane. "},{"joke_id":"RE5tyqqi","USF1000_rating":5.0,"USF1001_rating":7.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyqqi","jokeText":"A monkey is getting stoned in a zoo...\nWelcome to India"},{"joke_id":"RE5tyqag","USF1000_rating":4.0,"USF1001_rating":6.0,"USF1002_rating":10.0,"source":"reddit","datasource_joke_id":"5tyqag","jokeText":"I've translated a popular Russian joke to English , wanna hear you reaction ))\nA young boy says to his father \"Dad, our math teacher is asking to see you.\"\n\n\"What happened?\" The father asks.\n\n\"Well, she asks me, 'how much is 7 * 9?' I answer '63' , then she asks, 'and 9 * 7?' so I asked 'what's the fucking difference?' \"\n\n\"Indeed, what is the difference?\" asks the father. ''Sure, I'll go.''\n\nThe next day, the boy comes home from school \"Dad, have you gone by the school?\" He asks.\n\n\"Not yet.\"\n\n\"Well when you do, come and see the gym teacher also.\"\n\n\"Why?\" asks the father.\n\nThe boy explains, \"Well we had a gym class today, and he asked me to raise my left arm, I did. Then my right arm, I also raised it. Then he asked me to lift my right leg, so I did. 'Now,' he says, 'lift your left leg,' so I asked 'What, am I suppose to stand on my cock!?'\"\n\n\"Exactly,\" says the father. \"Alright, I'll come.\"\n\nThe next day, the boy asks his father \"Did you go to the school?\"\n\n\"No, not yet.\"\n\n\"Don't bother, I got expelled.\"\n\nSurprised, the father asks \"Why did you get expelled?\"\n\n\"Well, they summoned me to the principal's office, and sitting there were the math teacher, the gym teacher, and the art teacher.\"\n\n\"The fuck was the art teacher doing there!?\" asks the father.\n\n\"That's what I said\" replied the boy."},{"joke_id":"RE5tymmf","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tymmf","jokeText":"What did the mommy bean say to her son when he asked for money?\nI dont have any, go ask your fava"},{"joke_id":"RE5tymff","USF1000_rating":3.0,"USF1001_rating":10.0,"USF1002_rating":1.0,"source":"reddit","datasource_joke_id":"5tymff","jokeText":"When You Break Up At 11:59 Tonight\nAnd save $300 instantly."},{"joke_id":"RE5tylhy","USF1000_rating":4.0,"USF1001_rating":10.0,"USF1002_rating":5.0,"source":"reddit","datasource_joke_id":"5tylhy","jokeText":"I wanted to buy an Audi.\nBut I can't A4'd it."},{"joke_id":"RE5tyl5a","USF1000_rating":1.0,"USF1001_rating":6.0,"USF1002_rating":1.0,"source":"reddit","datasource_joke_id":"5tyl5a","jokeText":"I'm Trying to Remember The Name of A Song\nIt's about a girl with amnesia talking to her Grandmother.\nThe lyrics are \"Oh, Nana, What's My Name?\""},{"joke_id":"RE5tykxd","USF1000_rating":3.0,"USF1001_rating":9.0,"USF1002_rating":10.0,"source":"reddit","datasource_joke_id":"5tykxd","jokeText":"What are minorities?\nLesser people. "},{"joke_id":"RE5tyk3b","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyk3b","jokeText":"Did you hear that Donald Trump is technically a plant?\nBecause all of his cells have built a wall."},{"joke_id":"RE5tyj4u","USF1000_rating":2.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyj4u","jokeText":"i had trouble swallowing a viagra last night\nmy neck was stiff for 4 hours"},{"joke_id":"RE5tyii8","USF1000_rating":6.0,"USF1001_rating":8.0,"USF1002_rating":2.0,"source":"reddit","datasource_joke_id":"5tyii8","jokeText":"What is the king of all school supplies?\nThe Ruler"},{"joke_id":"RE5tygzy","USF1000_rating":5.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tygzy","jokeText":"A rugby player was hurt very badly during a scrum and he had both of his ears ripped off...\nSince he was permanently disfigured, he decided to give up playing rugby for good.\n\n His club and insurance company ensured that a large sum of money went his way.\n\nOne day, he decided to invest his money in a small but growing sportswear business. \n\nHe bought the company outright but after signing on the dotted line, realized that he knew nothing about business. \n\nHe decided to employ someone to run the shop.\n\nThe next day he set up three interviews. \n\nThe first guy was great. \n\nHe knew everything he needed to and was very enthusiastic. \n\nAt the end of the interview, the former rugby player asked him, “Do you notice anything different about me?”\n\nAnd the man replied, “Why, yes, I couldn’t help noticing you have no ears.” \n\nThe rugby player got angry and threw him out.\n\nThe second interview was with a woman, and she was even better than the first guy. \n\nHe asked her the same question, “Do you notice anything different about me?”\n\nShe replied: “Well, you have no ears.” \n\nHe got upset again and showed her the door.\n\nThe third and last interview was with the best of the three. \n\nHe was a very young man fresh out of college. \n\nHe was smart and handsome and seemed to know all about the sportswear business.\n\nThe rugby player was anxious, but went ahead and asked him the same question: “Do you notice anything different about me?”\n\nTo his surprise the young man answered: “Yes, you wear contact lenses.”\n\nThe former rugby player was shocked, and said, “What an incredibly observant young man you are. How in the world did you know that?”\n\nThe young man fell off his chair laughing hysterically and replied, “Well, it’s pretty hard to wear glasses with no flipping ears!”"},{"joke_id":"RE5tygyu","USF1000_rating":7.0,"USF1001_rating":2.0,"USF1002_rating":2.0,"source":"reddit","datasource_joke_id":"5tygyu","jokeText":"A man was in his front yard mowing grass when his attractive blonde female !!\nA man was in his front yard mowing grass when his attractive blonde female neighbor came out of the house and went straight to the mail box.\n\nShe opened it, slammed it shut, and stormed back in the house.\n\nA little later she came out of her house and again went to the mail box and again opened it, then slammed it shut again. Angrily, back into the house she went.\n\nAs the man was getting ready to edge the lawn, here she came out again, marched to the mail box, opened it and then slammed it closed harder than ever.\n\nPuzzled by her actions the man asked her, “Is something wrong?”\n\nTo which she replied, “There certainly is! My stupid computer keeps giving me a message saying, “YOU’VE GOT MAIL!”"},{"joke_id":"RE5tygq5","USF1000_rating":7.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tygq5","jokeText":"A woman runs into a doctor’s office and says “DOCTOR! DOCTOR! You have to help me! Everywhere I touch on my body it hurts!”\nA woman runs into a doctor’s office and says “DOCTOR! DOCTOR! You have to help me! Everywhere I touch on my body it hurts!”\n\nThe doctor replied, “Show me.”\n\nSo the woman poked her ankle and screamed of pain. Then she poked her knee and yelled OW. She poked her forehead and screamed again.\n\nShe was about to continue when the doctor said, “That’s enough, let me think this over.” He thought for about a minute and said “I think I know what your problem is. You broke your finger.”"},{"joke_id":"RE5tyfyh","USF1000_rating":5.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyfyh","jokeText":"Why did the producers of 007 films use government debt to fund their newest film?\nBecause interest in the Bond is so low."},{"joke_id":"RE5tyfoj","USF1000_rating":6.0,"USF1001_rating":6.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyfoj","jokeText":"Pocket empty day !\nHappy pocket empty day."},{"joke_id":"RE5tyf21","USF1000_rating":3.0,"USF1001_rating":9.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyf21","jokeText":"I want to see that new movie coming out with Scarlett Johannson…\n…but she probably isn't available."},{"joke_id":"RE5tyezd","USF1000_rating":2.0,"USF1001_rating":5.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyezd","jokeText":"Man gets lost in the desert.\nHe has no compass and he has lost his sense of direction. \n\nSuddenly he sees a caravan on the horizon. He jumps, shouts and waves his arms to get their attention, and, oh joy, they notice him and move in his direction. \n\nBut his happiness is short lived, as the travelers turn out to be mean and sadistic. They rough him up, and then bury him in the sand with only his head above the surface.\n\nHe grimly contemplates whether he'll die of sun stroke, dehydration or from attack of some savage beast. Suddenly, a lone traveler appears in front of him and inquires about his predicament. \n\n**You see, first I got lost, without a compass and provisions. Then I encountered these sadists, who beaten me up, bury me this way and left... Can you believe such behavior?**\n\n**Tsk, tsk...** says the traveler, as he puts his foot on top of the man's head and pushes it under the surface **Amateurs, such amateurs...**"},{"joke_id":"RE5tyess","USF1000_rating":2.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyess","jokeText":"Why is it so hard to break up with a Japanese Girl?\nYou have to drop the Bomb twice before she gets the Message. \n"},{"joke_id":"RE5tyegn","USF1000_rating":7.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"reddit","datasource_joke_id":"5tyegn","jokeText":"Site of the 2017 Dane county massacre.\nAll that is left after tens of snowmen were brutally melted on this spot by a massive indifferent ball of fire."},{"joke_id":"JE1","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":1.0,"source":"jester","datasource_joke_id":"1","jokeText":"A man visits the doctor. The doctor says \"I have bad news for you.You have\ncancer and Alzheimer's disease\". \nThe man replies \"Well,thank God I don't have cancer!\"\n"},{"joke_id":"JE2","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"2","jokeText":"This couple had an excellent relationship going until one day he came home\nfrom work to find his girlfriend packing. He asked her why she was leaving him\nand she told him that she had heard awful things about him. \n\n\"What could they possibly have said to make you move out?\" \n\n\"They told me that you were a pedophile.\" \n\nHe replied, \"That's an awfully big word for a ten year old.\" \n"},{"joke_id":"JE3","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"3","jokeText":"Q. What's 200 feet long and has 4 teeth? \n\nA. The front row at a Willie Nelson Concert.\n"},{"joke_id":"JE4","USF1000_rating":4.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"4","jokeText":"Q. What's the difference between a man and a toilet? \n\nA. A toilet doesn't follow you around after you use it.\n"},{"joke_id":"JE5","USF1000_rating":1.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"5","jokeText":"Q.\tWhat's O. J. Simpson's Internet address? \nA.\tSlash, slash, backslash, slash, slash, escape.\n"},{"joke_id":"JE6","USF1000_rating":7.0,"USF1001_rating":8.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"6","jokeText":"Bill & Hillary are on a trip back to Arkansas. They're almost out of gas, so Bill pulls into a service station on the outskirts of\ntown. The attendant runs out of the station to serve them when Hillary realizes it's an old boyfriend from high school. She and\nthe attendant chat as he gases up their car and cleans the windows. Then they all say good-bye. \n\nAs Bill pulls the car onto the road, he turns to Hillary and says, 'Now aren't you glad you married me and not him ? You could've\nbeen the wife of a grease monkey !' \n\nTo which Hillary replied, 'No, Bill. If I would have married him, you'd be pumping gas and he would be the President !' \n"},{"joke_id":"JE7","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"7","jokeText":"How many feminists does it take to screw in a light bulb?\nThat's not funny.\n"},{"joke_id":"JE8","USF1000_rating":7.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"8","jokeText":"Q. Did you hear about the dyslexic devil worshiper? \n\nA. He sold his soul to Santa.\n"},{"joke_id":"JE9","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":3.0,"source":"jester","datasource_joke_id":"9","jokeText":"A country guy goes into a city bar that has a dress code, and the maitre\nd' \ndemands he wear a tie. Discouraged, the guy goes to his car to sulk when \ninspiration strikes: He's got jumper cables in the trunk! So he wraps\nthem around his neck, sort of like a string tie (a bulky string tie to be\nsure) and returns to the bar. The maitre d' is reluctant, but says to the\nguy, \"Okay, you're a pretty resourceful fellow, you can come in... but\njust don't start anything\"!  \n"},{"joke_id":"JE10","USF1000_rating":8.0,"USF1001_rating":6.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"10","jokeText":"Two cannibals are eating a clown, one turns to other and says: \n\"Does this taste funny to you? \n"},{"joke_id":"JE11","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"11","jokeText":"Q. What do a hurricane, a tornado, and a redneck\ndivorce all have in common? \nA. Someone's going to lose their trailer...\n"},{"joke_id":"JE12","USF1000_rating":1.0,"USF1001_rating":1.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"12","jokeText":"A guy stood over his tee shot for what seemed an eternity, looking up, looking down, measuring the distance,\nfiguring the wind direction and speed. Driving his partner nuts.\n\nFinally his exasperated partner says, \"What the hell is taking so long? Hit the goddamn ball!\"\nThe guy answers, \"My wife is up there watching me from the clubhouse. I want to make this a perfect shot.\"\n\"Well, hell, man, you don't stand a snowball's chance in hell of hitting her from here!\" \n"},{"joke_id":"JE13","USF1000_rating":7.0,"USF1001_rating":9.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"13","jokeText":"They asked the Japanese visitor if they have elections in his\ncountry.  \n\"Every Morning\" he answers.\n"},{"joke_id":"JE14","USF1000_rating":0.0,"USF1001_rating":9.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"14","jokeText":"The father was very anxious to marry off his only daughter so he wanted \nto impress her date. \"Do  you like to screw,\" he says. \"Huh\" replied the \nsurprised first date. \"My daughter she loves to screw and she's good at it, \nyou and her  should go screw,\" carefully explained the father. Now very \ninterested the boy replied, \"Yes, sir.\" Minutes later the girl came down \nthe stairs, kissed her father goodbye and the couple left. After only a \nfew minutes she reappeared, furious, dress torn, hair a mess and screamed\n\"Dammit, Daddy, it's the TWIST, get it straight!\" \n"},{"joke_id":"JE15","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"15","jokeText":"Q:  What did the blind person say when given some matzah?\n\nA:  Who the hell wrote this?\n"},{"joke_id":"JE16","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"16","jokeText":"Q. What is orange and sounds like a parrot?  \n\nA. A carrot.\n"},{"joke_id":"JE17","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"17","jokeText":"How many men does it take to screw in a light bulb? \n\nOne...men will screw anything. \n"},{"joke_id":"JE18","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"18","jokeText":"A dog walks into Western Union and asks the clerk to send a telegram. He fills out a form on which he\nwrites down the telegram he wishes to send: \"Bow wow wow, Bow wow wow.\"\n\nThe clerk says, \"You can add another 'Bow wow' for the same price.\"\n\nThe dog responded, \"Now wouldn't that sound a little silly?\" \n"},{"joke_id":"JE19","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"19","jokeText":"Q: If a person who speaks three languages is called \"tri-lingual,\" and\na person who speaks two languages is called \"bi-lingual,\" what do call\na person who only speaks one language?\n\nA: American! \n"},{"joke_id":"JE20","USF1000_rating":6.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"20","jokeText":"What's the difference between a MacIntosh and an\nEtch-A-Sketch? \n\nYou don't have to shake the Mac to clear the screen. \n"},{"joke_id":"JE21","USF1000_rating":8.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"21","jokeText":"What's the difference between a used tire and 365 used condoms?\n\nOne's a Goodyear, the other's a great year.\n"},{"joke_id":"JE22","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"22","jokeText":"A duck walks into a pharmacy and asks for a condom. The pharmacist says\n\"Would you like me to stick that on your bill?\"\nThe duck says: \n\"What kind of duck do you think I am!\"\n"},{"joke_id":"JE23","USF1000_rating":5.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"23","jokeText":"Q: What is the Australian word for a boomerang that won't\n   come back? \n\nA: A stick\n"},{"joke_id":"JE24","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":8.0,"source":"jester","datasource_joke_id":"24","jokeText":"What do you get when you run over a parakeet with a lawnmower? \nShredded tweet.\n"},{"joke_id":"JE25","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"25","jokeText":"Two kindergarten girls were talking outside: one said, \"You\nwon't believe what I saw on the patio yesterday--a condom!\"\n\nThe second girl asked, \"What's a patio?\"\n"},{"joke_id":"JE26","USF1000_rating":9.0,"USF1001_rating":7.0,"USF1002_rating":5.0,"source":"jester","datasource_joke_id":"26","jokeText":"A guy walks into a bar and sits down next to an extremely gorgeous \nwoman.  The first thing he notices about her though, are her pants.  \nThey were skin-tight, high-waisted and had no obvious mechanism \n(zipper, buttons or velcro) for opening them.\n\nAfter several minutes of puzzling over how she got the pants up over \nher hips, he finally worked up the nerve to ask her.  \"Excuse me miss, \nbut how do you get into your pants?\"\n\n\"Well,\" she replied, \"you can start by buying me a drink.\"\n"},{"joke_id":"JE27","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"27","jokeText":"Clinton returns from a vacation in Arkansas and walks down  the\nsteps of Air Force One with two pigs under his arms.  At the bottom\nof the steps, he says  to the honor guardsman, \"These are genuine\nArkansas Razor-Back Hogs.  I got this one for Chelsea and this one for\nHillary.\"  \n\nThe guardsman replies, \"Nice trade, Sir.\"\n"},{"joke_id":"JE28","USF1000_rating":7.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"28","jokeText":"A mechanical, electrical and a software engineer from Microsoft were\ndriving through the desert when the car broke down. The mechanical\nengineer said \"It seems to be a problem with the fuel injection system,\nwhy don't we pop the hood and I'll take a look at it.\" To which the\nelectrical engineer replied, \"No I think it's just a loose ground wire,\nI'll get out and take a look.\" Then, the Microsoft engineer jumps in.\n\"No, no, no. If we just close up all the windows, get out, wait a few\nminutes, get back in, and then reopen the windows everything will work\nfine.\"\n"},{"joke_id":"JE29","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":4.0,"source":"jester","datasource_joke_id":"29","jokeText":"An old Scotsmen is sitting with a younger Scottish gentleman and says the boy. \n\"Ah, lad look out that window. You see that stone wall there, I built it with\nme own bare hands, placed every stone meself.  But do they call me MacGregor the\nwall builder? No! \n\nHe Takes a few sips of his beer then says, \"Aye, and look out on that lake and \neye that beautiful pier. I built it meself, laid every board and hammered each\nnail but do they call me MacGregor the pier builder? No! \n\nHe continues...\"And lad, you see that road? That too I build with me own bare \nhands. Laid every inch of pavement meself, but do they call MacGregor the road\nbuilder? No!\"\n\nAgain he returns to his beer for a few sips, then says, \n\"Agh, but you screw one sheep...\"\n"},{"joke_id":"JE30","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"30","jokeText":"Q: What's the difference between a Lawyer and a Plumber? \nA: A Plumber works to unclog the system.\n"},{"joke_id":"JE31","USF1000_rating":4.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"31","jokeText":" President Clinton looks up from his desk in the Oval Office to see\n one of his aides nervously approach him. \n \"What is it?\" exclaims the President. \n\"It's this Abortion Bill Mr. President, what do you want to do\n about it?\" the aide replies. \n\"Just go ahead and pay it.\" responds the President. \n"},{"joke_id":"JE32","USF1000_rating":4.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"32","jokeText":"A man arrives at the gates of heaven. St. Peter asks, \"Religion?\" \nThe man says, \"Methodist.\" St. Peter looks down his list, and says, \n\"Go to room 24, but be very quiet as you pass room 8.\" \n\nAnother man arrives at the gates of heaven. \"Religion?\"\n\"Baptist.\" \"Go to room 18, but be very quiet as you pass room 8.\" \n\nA third man arrives at the gates. \"Religion?\" \"Jewish.\"\n\"Go to room 11, but be very quiet as you pass room 8.\" \nThe man says, \"I can understand there being different rooms for different religions, but why\nmust I be quiet when I pass room 8?\" St. Peter tells him, \"Well the Catholics are in room 8, \nand they think they're the only ones here.\n"},{"joke_id":"JE33","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"33","jokeText":"What do you call an American in the finals of the world cup?\n\n\"Hey Beer Man!\"\n"},{"joke_id":"JE34","USF1000_rating":6.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"34","jokeText":"Out in the backwoods of some midwestern state, little Johnny arrives\nat school an hour late.\n\nTeacher: \"Why are you so late, John?\"\nJohny : \"My big brother got shot in the ass.\"\n(the teacher corrects his speech)\nTeacher: \"Rectum.\"\nJohnny : \"Wrecked him!? Hell, It damn near killed him!\" \n"},{"joke_id":"JE35","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"35","jokeText":"An explorer in the deepest Amazon suddenly finds himself surrounded\nby a bloodthirsty group of natives. Upon surveying the situation, he\nsays quietly to himself, \"Oh God, I'm screwed.\" \n\nThe sky darkens and a voice booms out, \"No, you are NOT\nscrewed. Pick up that stone at your feet and bash in the head of the\nchief standing in front of you.\" \n\nSo with the stone he bashes the life out of the chief. Standing above\nthe lifeless body, breathing heavily looking at 100 angry natives... \n\nThe voice booms out again, \"Okay ..... NOW you're screwed.\" \n"},{"joke_id":"JE36","USF1000_rating":7.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"36","jokeText":"A guy walks into a bar, orders a beer and says to the bartender,\n\"Hey, I got this great Polish Joke...\" \n\nThe barkeep glares at him and says in a warning tone of voice:\n\"Before you go telling that joke you better know that I'm Polish, both\nbouncers are Polish and so are most of my customers\"\n\n\"Okay\" says the customer,\"I'll tell it very slowly.\" \n"},{"joke_id":"JE37","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"37","jokeText":"A Jewish young man was seeing a psychiatrist for an eating and\nsleeping disorder. \n\n\"I am so obsessed with my mother... As soon as I go to sleep, I start\ndreaming, and everyone in my dream turns into my mother. I wake up in\nsuch a state, all I can do is go downstairs and eat a piece of toast.\"\n\nThe psychiatrist replies:\n\n\"What, just one piece of toast, for a big boy like you?\"\n"},{"joke_id":"JE38","USF1000_rating":1.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"38","jokeText":"\"May I take your order?\" the waiter asked. \n\n\"Yes, how do you prepare your chickens?\" \n\n\"Nothing special sir,\" he replied. \"We just tell them straight out\nthat they're going to die.\"\n"},{"joke_id":"JE39","USF1000_rating":7.0,"USF1001_rating":9.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"39","jokeText":"What is the difference between men and women:\n\n\nA woman wants one man to satisfy her every need.\nA man wants every woman to satisfy his one need.\n"},{"joke_id":"JE40","USF1000_rating":3.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"40","jokeText":"How many Irishmen does it take to change a lightbulb?\n\nTwo, one to hold the lightbulb and the other to drink until the room spins. \n"},{"joke_id":"JE41","USF1000_rating":1.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"41","jokeText":"What does an atheist say during an orgasm?\n\"Oh Darwin! Oh Darwin!...\"\n"},{"joke_id":"JE42","USF1000_rating":4.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"42","jokeText":"Two men are discussing the age old question: who enjoys sex more, the\nman or the woman?  A woman walks by and listens in for awhile and then\ninterrupts: \n\"Listen you guys. You know when your ear itches and you put in your \nlittle finger and wiggle it around for awhile?  Afterward,\nwhich feels better, your finger or your ear?\"\n"},{"joke_id":"JE43","USF1000_rating":3.0,"USF1001_rating":0.0,"USF1002_rating":1.0,"source":"jester","datasource_joke_id":"43","jokeText":"Arnold Swartzeneger and Sylvester Stallone are making a movie about\nthe lives of the great composers.  \nStallone says \"I want to be Mozart.\" \nSwartzeneger says: \"In that case...  I'll be Bach.\"\n"},{"joke_id":"JE44","USF1000_rating":7.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"44","jokeText":"A horse walks into a bar. Bartender says:\n\"So, why the long face?\"\n"},{"joke_id":"JE45","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":1.0,"source":"jester","datasource_joke_id":"45","jokeText":"A boy comes home from school and tells his mother that he got a part\nin the school play.  \"What part?\" the mother asked. \"I play a Jewish\nhusband,\" the boy replied.  \n\"Go back to school and tell your teacher that you want a speaking role!\"\n"},{"joke_id":"JE46","USF1000_rating":6.0,"USF1001_rating":8.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"46","jokeText":"A couple has been married for 75 years. For the husband's 95th\nbirthday, his wife decides to surprise him by hiring a prostitute.\nThat day, the doorbell rings. The husband uses his walker to get to\nthe door and opens it. \nA 21-year-old in a latex outfit smiles and\nsays, \"Hi, I here to give you super sex!\" \nThe old man says, \"I'll take the soup.\"\n"},{"joke_id":"JE47","USF1000_rating":2.0,"USF1001_rating":10.0,"USF1002_rating":1.0,"source":"jester","datasource_joke_id":"47","jokeText":"There was an engineer who had an exceptional gift for fixing all \nthings mechanical.  After serving his company loyally for over 30 \nyears, he happily retired.  Several years later the company contacted \nhim regarding a seemingly impossible problem they were having with \none of their multi-million dollar machines. They had tried everything and \neveryone else to get the machine fixed, but to no avail.  In \ndesperation, they called on the retired engineer who had solved so \nmany of their problems in the past.\nThe engineer reluctantly took the challenge.  He spent a day studying \nthe huge machine.  At the end of the day, he marked a small \"x\" in \nchalk on a particular component of the machine and proudly stated, \n\"This is where your problem is\".\nThe part was replaced and the machine worked perfectly again. The \ncompany received a bill for $50,000 from the engineer for his \nservice.They demanded an itemized accounting of his charges. The \nengineer responded briefly:\nOne chalk mark                       $1 \nKnowing where to put it            $49,999\nIt was paid in full and the engineer retired again in peace. \n"},{"joke_id":"JE48","USF1000_rating":0.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"48","jokeText":"The graduate with a Science degree asks, \"Why does it work?\"\nThe graduate with an Engineering degree asks, \"How does it work?\"\nThe graduate with an Accounting degree Asks, \"How much will it cost?\" \nThe graduate with a  Liberal Arts degree asks, \"Do you want fries \nwith  that?\"\n"},{"joke_id":"JE49","USF1000_rating":4.0,"USF1001_rating":10.0,"USF1002_rating":8.0,"source":"jester","datasource_joke_id":"49","jokeText":"Three engineering students were gathered together discussing the\npossible designers of the human body.  \nOne said, \"It was a mechanical engineer. Just look at all the joints.\"  \nAnother said, \"No, it was an electrical engineer.  The nervous systems many thousands of electrical\nconnections.\"  \nThe last said, \"Actually it was a civil engineer. Who else would run a toxic waste pipeline through a recreational area?\"\n"},{"joke_id":"JE50","USF1000_rating":8.0,"USF1001_rating":9.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"50","jokeText":"A guy goes into confession and says to the priest, \"Father, I'm 80 years\nold, widower, with 11 grandchildren. Last night I met two beautiful flight\nattendants. They took me home and I made love to both of them. Twice.\"\n\nThe priest said: \"Well, my son, when was the last time you were in\nconfession?\"\n \"Never Father, I'm Jewish.\"\n \"So then, why are you telling me?\"\n \"I'm telling everybody.\"\n"},{"joke_id":"JE51","USF1000_rating":10.0,"USF1001_rating":0.0,"USF1002_rating":3.0,"source":"jester","datasource_joke_id":"51","jokeText":"Did you hear that Clinton has announced there is a new national bird?  \nThe spread eagle.\n"},{"joke_id":"JE52","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"jester","datasource_joke_id":"52","jokeText":"Q: What do Monica Lewinsky and Bob Dole have in common?\nA: They were both upset when Bill finished first.\n"},{"joke_id":"SS1","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1","jokeText":"A blackjack dealer and a player with a thirteen count in his hand\nwere arguing about whether or not it was appropriate to tip the\ndealer.\n\nThe player said, \"When I get bad cards, it's not the dealer's fault.\nAccordingly, when I get good cards, the dealer obviously had nothing\nto do with it so, why should I tip him?\"\n\nThe dealer said, \"When you eat out do you tip the waiter?\"\n\n\"Yes.\"\n\n\"Well then, he serves you food, I'm serving you cards, so you should\ntip me.\"\n\n\"Okay, but, the waiter gives me what I ask for. I'll take an eight.\""},{"joke_id":"SS2","USF1000_rating":6.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2","jokeText":"At a dinner party, several of the guests were arguing whether men or women were more trustworthy. 'No woman,' said one man, scornfully, 'can keep a secret.' 'I don't know about that,' answered a blonde woman guest. 'I have kept my age a secret since I was twenty-one.' 'You'll let it out some day,' the man insisted. 'I hardly think so!' responded the blonde lady. 'When a woman has kept a secret for twenty-seven years, she can keep it forever.'"},{"joke_id":"SS282","USF1000_rating":8.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"282","jokeText":"German scientists dug 50 meters underground and discovered small\npieces of copper. After studying these pieces for a long time,\nGermany announced that the ancient Germans had a nationwide\ntelephone network.\n\nNaturally, the British government was not that easily impressed.\nThey ordered their own scientists to dig even deeper. 100 meters\ndown, they found small pieces of glass, and they soon announced that\nthe ancient Brits already had a nationwide fibre optic network.\n\nIsraeli scientists were outraged. They dug 50, 100 and 200 meters\nunderground, but found absolutely nothing...\n\nThey concluded that the ancient Hebrews had cellular telephones."},{"joke_id":"SS710","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"710","jokeText":"A life-long city man, tired of the rat race, decided he was going to give up the city life, move to the country, and become a chicken farmer. He bought a nice, used chicken farm and moved in. As it turned out, his next door neighbor was also a chicken farmer. The neighbor came for a visit one day and said, \"Chicken farming isn  't easy. Tell you what. To help you get started, I  'll give you 100 chickens.\" The new chicken farmer was thrilled. Two weeks later the neighbor dropped by to see how things were going. The new farmer said, \"Not too well. All 100 chickens died.\" The neighbor said, \"Oh, I can  't believe that. I  've never had any trouble with my chickens. I  'll give you 100 more.\" Another two weeks went by and the neighbor stopped by again. The new farmer said, \"You  're not going to believe this, but the second 100 chickens died too.\" Astounded, the neighbor asked, \"What went wrong?\" The new farmer said, \"Well, I  'm not sure whether I  'm planting them too deep or too close together.\""},{"joke_id":"SS163","USF1000_rating":8.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"163","jokeText":"An old man goes to the Wizard to ask him if he can remove a curse he has been living with for the last 40 years.The Wizard says \"Maybe, but you will have to tell me the exact words that were used to put the curse on you.\"The old man says without hesitation, \"I now pronounce you man and wife.\""},{"joke_id":"SS2559","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2559","jokeText":"The Pope, Billy Graham, and Oral Roberts were in a three-way plane crash over the Atlantic Ocean. Tragically, they all died and went to the Pearly Gates together. \"Oh, this is terrible,\" exclaims St. Peter, \"I know you guys think we summoned you here, but this is just one of those coincidences that happen. St. Peter was fretting, \"Since we weren't expecting you, your quarters just aren't ready. We can't take you in just yet and we can't send you back.\" Then he got an idea. He picked up the phone, \"Lucifer, this is Pete. Hey, I got these three guys up here. They're ours, but we weren't expecting them, and we gotta fix the place up for 'em. I was hoping you could put them up for a while. It'll only be a couple of days. I'll owe you one.\" Reluctantly, the Devil agreed. Two days later... \"Pete, this is Lucifer. Hey you gotta come get these three clowns. This Pope guy is forgiving everybody, the Graham fellow is saving everybody, and Oral Roberts has raised enough money to buy air conditioning!\""},{"joke_id":"SS1424","USF1000_rating":8.0,"USF1001_rating":8.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1424","jokeText":"Yo Mama So old that I told her to act her age and she died.\nYo Mama So old that when she was in school they didn't have history.\nYo Mama So nasty she brought her own crabs to the beach.\nYo Mama So ugly we tied a steak to her neck so she could play with the family dog.\nYo Mama So stupid she thought a quarterback was a refund.\nYo Mama So fat she played billiards with the planets.\nYo Mama So fat she sat on a rainbow and made skittles.\nYo Mama So fat she sat on a dollar and made change.\nYo Mama So ugly that satan sent her back.\nYo Mama So fat that your dad has to have a \"heavy machinary\" license to have sex.\nYo Mama So poor that I walked in the front door and fell out the back.\nYo Mama So poor that I borrowed your skateboard and she called the cops saying her car got stolen.\nYo Mama So dumb she thought a harddrive was a rough road.\nYo Mama So dumb she thought floppy disk was when her back hurt.\nYo Mama So fat that when she sits around the house she sits \"around\" the house.\nYo Mama So fat she bathes in the ocean.\nYo Mama So fat she isn't allowed on the 2nd floor.\nYo Mama So fat that she needed a blinkin light so planes woulden't hit her.\nYo Mama So fat she seen a bus and thought it was a twinkie.\nYo Mama So ugly she scared Michael Jackson.\nYo Mama So poor she married Michael Jackson.\nYo Mama So old that she birthed God.\nYo Mama So fat she has to sit in the middle of the car."},{"joke_id":"SS335","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"335","jokeText":"Three men go golfing together one day. When they get to the Third hole, one said to the other, \"How did you manage to get here today past your wife?\"The second man said, \"It wasnt easy. I had to promise my wife that I would paint the full house outside. How did you do it?\"\"Well,\" the second man replied, \"I promised my wife that I would remodel the Kitchen and Bathroom.\"Then, a few holes latter, the first two asked the thrid man how he got here today.\"Easy,\" said the third man. \"I put my alarm on last night for five thirty this morning, and when the alarm went off, I rolled over, tapped my wife on the shoulder and said, 'Golf course or Intercourse.' and she replied back, \" You better take a sweater, I think its going to be cold\"   PM"},{"joke_id":"SS536","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"536","jokeText":"Joan, who was a rather well-proportioned secretary, spent almost all of her vacation sunbathing on the roof of her hotel. She wore a bathing suit the first day, but on the second, she decided that no one could see her way  up there, and she slipped out of it for an overall tan. She'd hardly begun  when she heard someone running up the stairs. She was lying on her stomach, so she just pulled a towel over her rear. \"Excuse me, miss,\" said the flustered assistant manager of the hotel, out  of breath from running up the stairs. \"The Hilton doesn't mind your sunbathing on the roof, but we would very much appreciate your wearing a  bathing suit as you did yesterday.\" \"What difference does it make?\" Joan asked rather calmly. \"No one can see  me up here, and besides, I'm covered with a towel.\" \"Not exactly,\" said the embarrassed man. \"You're lying on the dining room skylight.\""},{"joke_id":"SS1581","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1581","jokeText":"Lets play house. You be the door and I'll slam you."},{"joke_id":"SS2510","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2510","jokeText":"There was this Christian lady that had to do a lot of traveling for her business so she did a lot of flying.But flying made her nervous so she always took her Bible along with her to read and it helped relax her. One time she was sitting next to a man.When he saw her pull out her Bible he gave a little chuckle and went back to what he was doing.After awhile he turned to her and asked \"You don't really believe all that stuff in there do you?\"The lady replied \"Of course I do.It is the Bible.\"He said \"Well what about that guy that was swallowed by that whale?She replied \"Oh, Jonah.Yes I believe that, it is in the Bible.He asked \"Well, how do you suppose he survived all that time inside the whale?\"The lady said \"Well I don't really know.I guess when I get to heaven I will ask him.\"\"What if he isn't in heaven?\" the man asked sarcastically.\"Then you can ask him.\"replied the lady."},{"joke_id":"SS1395","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1395","jokeText":"Yo mamma so fat I drove aroundd her and ran out of gas"},{"joke_id":"SS2795","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2795","jokeText":"Q: How many supply-siders does it take to change a light bulb?\nA: None. The darkness will cause the light bulb to change by itself."},{"joke_id":"SS873","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"873","jokeText":"A curious eleven year old boy asked his mother, \"is God male or female?\"  She hesitates for a brief moment, and responds, \"God is both male and female.\"  Still curious, he asked...\"is God black or white?\"  She responds along the same line...\"God's both black and white.\"   Finally, the boy asks...\"is God gay or straight?\"  His mother, now concerned, answered...\"honey, God's both gay and straight, why do you ask?\"  The confused boy hesitates, then asks..\"mom isGod and Michael Jackson the same person?\""},{"joke_id":"SS964","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":9.0,"source":"stupidstuff","datasource_joke_id":"964","jokeText":"On the first day God created the cow...\nGod said,  \"you must go to field with the farmer all day long \nand suffer under the sun, have calves and give milk to support \nthe farmer...for that I will give you a life span of sixty years.\" \n   The cow said, \"that's kind of a tough life, you want me to live \nfor sixty years...let me have twenty years and I'll give back \nthe other forty\" and God agreed.\n\nOn the second day, God created the dog...\nGod said, \"sit all day by the door of your house and bark at anyone \nwho comes in or walks past...I'll give you a life span of twenty years.\"\n   The dog said, \"that's too long to be barking...\ngive me ten years and I'll give back the other ten.\" So God agreed. \n\nOn the third day God created the monkey...\nGod said, entertain people, do monkey tricks, make them laugh... \nI'll give you a twenty year life span.\" \n   the monkey said, \"how boring, monkey tricks for twenty years? \nI don't think so...dog gave you back ten, so that's what I'll do too.\" \nAnd God agreed again. \n\nNow on the fourth day, God created man... \nGod said, \"Eat, sleep, play, have sex,  enjoy...do nothing, \njust enjoy, enjoy... I'll give you twenty years.\" \n   Man said, \"what...only twenty years?  no way man, tell you what,  \nI'll take my twenty...the forty cow gave back...\nthe ten dog gave back and the ten monkey gave back...\nthat makes eighty, okay?\" \"Okay,\" said God... \"you've got a deal!\" \n \nSo this is why for...\nthe first twenty years we eat, sleep, play, have sex, enjoy, and do nothing... \nthe next forty years we slave in the sun to support our family...\nthe next ten years we do monkey tricks to entertain our grandchildren...\nthe last ten years we sit in front of the house and bark at everybody...\n \nlife has now been explained."},{"joke_id":"SS3579","USF1000_rating":9.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3579","jokeText":"Returning from a trip to visit my grandmother in Canada, I was stopped by a state trooper in New York for exceeding the speed limit. Grateful to have received a warning instead of a ticket, I gave him a small bag of my grandmother's delicious chocolate chip cookies and proceeded on my way.\n\nLater, I was stopped by another trooper. \"What have I done?\" I asked.\n\n\"Nothing,\" the trooper said, smiling. \"I heard you were passing out great chocolate chip cookies.\""},{"joke_id":"SS2055","USF1000_rating":10.0,"USF1001_rating":5.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2055","jokeText":"One Sunday morning, the priest noticed that little Anthony was staring up at the large plaque that hung in the foyer of the church.The plaque was covered with names, and small American flags were mounted on either side of it. The ten year old boy had been staring at the plaque for some time, so the priest walked up, stood beside the boy, and said quietly, \"Good morning Anthony.\"\"Good morning father,\" replied the young man, still focused on the plaque.\"Father Murphy, what is this?\" Anthony asked.\"Well, son, its a memorial to all the young men and women who died in the service.\"Soberly they stood together, staring at the large plaque.Little Anthony's voice was barely audible when he asked, \"Which service, the 9:00 or the 10:30?\""},{"joke_id":"SS291","USF1000_rating":7.0,"USF1001_rating":6.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"291","jokeText":"you make woman so beautiful?\" \n\nGod says: \"So you would love her.\" \n\n\"But God,\" the man says, \"why did you make her so dumb?\" \n\nGod says: \"So she would love you.\""},{"joke_id":"SS1270","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1270","jokeText":"One day the pope was in from Italy and after a rough week of meeting arch bishops and other religious figures, he decided to go see the Galveston shore in Texas.\n\nWhen he arrives in his popemobile he sees a man strugling for his life aginst a shark.\n\nUpon a closer look he notices that it is John Kerry.\n\nHorrified he starts to call for help when a speedboat pulls up along side Mr Kerry, with GW and Dick Cheney on board. Dick Checny leans over and pulls him out. Then George W, and Dick Cheney begin to beat the shark to death with baseball bats.\n\nThe two men notice the Pope and land the boat on the beach.\n\nThe pope said to the men,\n\n\"I know that there has been alot of attention and alot of strife in this election, but I can see that you two men respect each other and would help each other in their house of need. You have my blessings\"\n\nThen the pope packs off and drives out of site.\n\nBush asks, \"Who was that?\"\n\n\"That was the pope Mr President, he is all knowing and in touch with god. Leader of the Chatholic Church\" Said Dick.\n\nBush says, \"Well thats all neat and fine, but he dosent know anything about shark fishing. Hows the bait holding up?\""},{"joke_id":"SS3254","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3254","jokeText":"My first is in kendo but not in Olympics.\nMy second is in hurdles and in hunting.\nMy third is in bowman and in bowling.\nMy fourth is in cycling and in golf.\nMy fifth is in flying and not in swimming.\nMy last is in running and not in dancing.\nMy whole is a sport.\nWhat am I?\n\nSee Answer below...\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n..\n\nThe answer to the Riddle is - Kung Fu"},{"joke_id":"SS1499","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1499","jokeText":"I wish you were all here. I don't like to think there is more!"},{"joke_id":"SS1559","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1559","jokeText":"I hear you are connected to the Police Department -- by a pair of handcuffs."},{"joke_id":"SS3298","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3298","jokeText":"Dear Santa,\n\nI understand that one of my colleagues has petitioned you for changes in her contract, specifically asking for anatomical and  career changes.\n\nIn addition, it is my understanding that disparaging remarks were made about me, my ability to please, and some of  my fashion choices.  I would like to take this opportunity to inform you of  some issues concerning Ms. Barbie, and some of my own needs and  desires.\n\nFirst of all, I, along with several other colleagues feel Barbie DOES NOT deserve preferential treatment - the bitch has everything.\n\nI, along with Joe, Jem, Raggedy Ann & Andy, DO NOT have a dreamhouse, Corvette, evening gowns, and in some cases the ability to change our hair style.  I personally have only 3 outfits  which I am forced to mix and match at great length. \n\nMy decision to accessorize my outfits with an earring was my decision and reflects my lifestyle choice.\n\nI too would like a change in my career.  Have you ever considered \"Decorator Ken\", \"Beauty Salon Ken\", or \"Out Of Work Actor Ken\"?  In addition, there are several other avenues which could be considered such as:  \"S&M Ken\" , \"Green Lantern Ken\",  \"Circuit  Ken\", \"Bear Ken\", \"Master Ken\".\n\nThese would more accurately reflect my desires and perhaps open up new markets.\n\nAnd as for Barbie  needing bendable arms so she can \"push me away,\" I need bendable knees so I can kick the bitch to the curb.  Bendable knees would also be helpful for me in other situations - we've talked about this issue before. \n\nIn closing, I would like to point out that any further concessions to the blond bimbo from hell will result in action being  taken by myself and others.  And Barbie can forget about having Joe - he's  mine... at least that's what he said last night.\n\nSincerely,\n\nKen"},{"joke_id":"SS3087","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3087","jokeText":"An old, bearded shepherd, with a crooked staff, walks up to a stone pulpit and says:\n\n\"And lo it came to pass that the trader by the name of Abraham Com did take unto himself a young wife by the name of Dot. And Dot Com was a comely woman, broad of shoulder and long of leg. Indeed, she had been called Amazon Dot Com. And she said unto Abraham, her husband, \"Why doth thou travel far, from town to town, with thy goods when thou can trade without ever leaving thy tent?\"\n\nAnd Abraham did look at her as though she were several saddle bags short of a camel load, but simply said, \"How, Dear?\" And Dot replied, \"I will place drums in all the towns and drums in between to send messages saying what you have for sale and they will reply telling you which hath the best price. And the sale can be made on the drums and delivery made by Uriah's Pony Stable (UPS)\".\n\nAbraham thought long and decided he would let Dot have her way with the drums. And the drums rang out and were an immediate success. Abraham sold all the goods he had, at the top price, without ever moving from his tent. But this success did arouse envy. A man named Maccabia did secrete himself inside Abraham's drum and was accused of insider trading. And the young man did take to Dot Com's trading as doth the greedy horsefly take to camel dung.\n\nThey were called Nomadic Ecclesiastical Rich Dominican Siderites, or NERDS for short. And lo the land was so feverish with joy at the new riches and the deafening sound of drums, that no one noticed that the real riches were going to the drum maker, one Brother William of Gates, who bought up every drum company in the land. And indeed did insist on making drums that would only work if you bought Brother Gates' drumsticks.\n\nAnd Dot did say, \"Oh, Abraham, what we have started is being taken over by others\". And as Abraham looked out over the Bay of Ezekiel, or as it came to be known, \"eBay,\" he said, \"we need a name of a service that reflects what we are,\" and Dot replied, \"Young Ambitious Hebrew Owner Operators.\" \"Whoopee!\", said Abraham. \"No, YAHOO!\", said Dot Com."},{"joke_id":"SS2871","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":9.0,"source":"stupidstuff","datasource_joke_id":"2871","jokeText":"Q: How many libertarians does it take to change a light bulb?\nA: Libertarians never change light bulbs, because someone might enter the room who wants to sit in the dark."},{"joke_id":"SS3629","USF1000_rating":9.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3629","jokeText":"A Jewish father was concerned about his son who was about a year away from his Bar Mitzvah, but was sorely lacking in his knowledge of the Jewish faith. To remedy this, he sent his son to Israel to experience his heritage. A year later the young man returned home \"Father, thank you for sending me to the land of our fathers,\" the son said. \"It was wonderful and enlightening; however, I must confess that while in Israel I converted to Christianity.\"\n\n\"Oi vey,\" replied the father, \"what have I done?\" So, in the tradition of the patriarchs, he went to his best friend and sought his advice and solace.\n\n\"It is amazing that you should come to me,\" stated his friend. \"I, too, sent my son to Israel and he returned a Christian.\" \n\nSo in the tradition of the patriarchs, they went to the Rabbi. \"It is amazing that you should come to me,\" stated the Rabbi. \"I, too, sent my son to Israel and he returned a Christian. What is happening to our sons? Brothers, we must take this to the Lord,\" said the Rabbi.\n\nThey fell to their knees and began to wail and pour our their hearts to the Almighty. As they prayed, the clouds above opened and a mighty voice said, \"Amazing that you should come to me. I, too, sent my Son to Israel....\""},{"joke_id":"SS1835","USF1000_rating":10.0,"USF1001_rating":5.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1835","jokeText":"TOP 10 OLD FOLKS' PARTY GAMES1.Sag, You're It!2.Pin the Toupee on the Bald Guy3.20 Questions Shouted into your Good Ear4.Kick the Bucket5.Red Rover, Red Rover, the Nurse Says Bend Over6.Doc, Doc Goose7.Simon Says Something Incoherent8.Hide and Go Pee9.Spin the Bottle of Mylanta10.Musical Recliners"},{"joke_id":"SS1333","USF1000_rating":7.0,"USF1001_rating":6.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1333","jokeText":"There were 4 people: A Congress man, George Bush, Osama Bin Laden and a solider and they were all in a helicopter. The pilot said that someone needs to jump, so Osama jumps and says: \"this is for my country\". A couple minutes later the pilot says someone needs to jump so the congress man jumps and says : \"this is for my country\". So a few minutes later the pilot says someone needs to jump so the solider says: \"this is for my country\" and pushes George Bush out the window."},{"joke_id":"SS1490","USF1000_rating":9.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1490","jokeText":"Two boys from the mountains, Leroy and Jasper have been promoted from privates to sergeants.\n\nNot long after, they're out for a walk and Leroy says, \"Hey Jasper, there's the NCO Club. Let's you and me stop in.\"\n\n\"But we's privates,\" protests Jasper.\n\n\"We's sergeants now, \"says Leroy, pulling him inside.\n\n\"Now, Jasper, I'm a-gonna sit down and have me a drink.\"\n\n\"But we's privates,\" says Jasper. \"Are you blind, boy?\" asks Leroy, pointing at his stripes. \"We's sergeants now.\"\n\nSo they have their drink, and pretty soon a hooker comes up to Leroy. \"You're cute,\" she says, \"and I'd like to date you, but I've got a bad case of gonorrhea.\"\n\nLeroy pulls his friend to the side and whispers, \"Jasper, go look in the dictionary and see what gonorrhea means. If it's okay, give me the okay sign.\" So Jasper goes to look it up, comes back, and gives Leroy the big okay sign.\n\nThree weeks later Leroy is laid up in the infirmary with a terrible case of gonorrhea. \"Jasper,\" he says, \"why did you give me the okay sign?\"\n\n\"Well, Leroy, in the dictionary, it says gonorrhea affects only the privates.\" He points to his stripes. \"But we's sergeants now!\""},{"joke_id":"SS2887","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2887","jokeText":"What did the horse say when he fell?\n\n\u0093I've fallen and I can't giddy up!\u0094"},{"joke_id":"SS2740","USF1000_rating":7.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2740","jokeText":"YOU KNOW YOU'VE BEEN DRINKING WAY TOO MUCH COFFEE WHEN....."},{"joke_id":"SS1482","USF1000_rating":8.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1482","jokeText":"Yo mama so fat that when she walks in high heels she strikes oil."},{"joke_id":"SS1728","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1728","jokeText":"A busload of politicians were driving down a country road when, all of a sudden, the bus ran off the road and crashed into a tree in an old farmer's field. The old farmer, after seeing what happened, went over to investigate. He then proceeded to dig a hole and bury the politicians.A few days later, the local sheriff came out, saw the crashed bus and asked the old farmer where all the politicians had gone.The old farmer said he had buried them.The sheriff asked the old farmer, \"Were they ALL dead?\"The old farmer replied, \"Well, some of them said they weren't, but you know how them politicians lie.\""},{"joke_id":"SS442","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"442","jokeText":"Little Mary was not the best student in Sunday school. Usually she slept through the class. One day the teacher called on her while she was napping, \"Tell me, Mary, who created the universe?\" When Mary didn't stir, little Johnny, an altruistic boy seated in the chair behind her, took a pin and jabbed her in the rear. \"God Almighty !\" shouted Mary. The teacher said, \"Very good!\" and Mary fell back to sleep. A while later the teacher asked Mary, \"Who is our Lord and Savior?\", but Mary didn't even stir from her slumber. Once again, Johnny came to the rescue and stuck her again. \"Jesus Christ!\" shouted Mary. The teacher said, \"Very good!\" and Mary fell back to sleep. Then the teacher asked Mary a third question, \"What did Eve say to Adam after she had her twenty-third child?\" Again, Johnny jabbed her with the pin. This time Mary jumped up and shouted, \"If you stick that damn thing in me one more time, I'll break it in half!\""},{"joke_id":"SS1555","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1555","jokeText":"There are several people in this world that I find obnoxious and you are all of them."},{"joke_id":"SS2842","USF1000_rating":9.0,"USF1001_rating":7.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2842","jokeText":"Q: How many efficiency experts does it take to replace a light bulb?\nA: None. Efficiency experts replace only dark bulbs."},{"joke_id":"SS1066","USF1000_rating":8.0,"USF1001_rating":8.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1066","jokeText":"My brother-in-law and I decided to spend the long weekend getting back\nto nature. We rented a trailer, took off to a secluded lake, got into\nour brand-new hiking gear, and promptly got lost.\n\nWe tried all the tactics we could remember from movies to figure out\nwhat direction we were headed. Moss on the trees? There wasn't any. The\ndirection of the sun? It was heavily overcast.\n\nJust as we were about to panic, my brother-in-law spotted a cabin off\nin the distance. He pulled out his binoculars and studied it closely.\nWith a cry of \"A-ha!\" he turned and led us right back to our camp.\n\n\"That was fantastic,\" I said. \"How did you do it?\"\n\n\"Simple,\" he replied. \"In this part of the country all the satellite\ndishes point south.\""},{"joke_id":"SS994","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"994","jokeText":"Police officers George and Mary, had been assigned to walk the beat.They had only been out a short while when Mary said, \"Damn, I was running late this morning after my workout and after I showered, I forgot to put on my panties! We have to go back to the station to get them.\"George replied, \"We don't have to go back, just give the K-9unit, Fido, one sniff, and he will go fetch them for you.\"It was a hot day and Mary didn't fell like heading back to thestation, so she lifted her skirt for the dog. Fido's noseshoots between her legs, sniffing and snorting.After 10 seconds of sniffing, Fido's ears pick up, he sniffsthe wind, and he is off in a flash towards the station house.Five minutes go by and no sign of Fido.Ten minutes pass, and the dog is nowhere to be seen.Fifteen minutes pass, and they are starting to worry.Twenty minutes pass, and they hear sirens in the distance.The sirens get louder and louder. Suddenly, followed by adozen police cars, Fido rounds the corner with the DeskSergeant's balls in his mouth."},{"joke_id":"SS587","USF1000_rating":5.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"587","jokeText":"A seventeen-year-old girl goes to see her mom and tells her that she has missed her period for two months.  Very worried, the mother goes to the drugstore and buys a pregnancykit. The test result shows that the girl is pregnant.  Shouting, cursing, crying, the mother says, \"Who was the pig that did this to you? I want to know!!\"  The girl picks up the phone and makes a call. Half an hour later abrand new Ferrari stops at their house, a mature and distinguished man,with grey hair and impeccably dressed in a very expensive suit stepsout of it and enters the house. He sits in the living room with thefather, the mother and the girl, and tells them:  \"Good morning, your daughter has informed me of the problem. However, I can't marry her because of my personal family situation, but I'll take charge. If a girl is born I will bequeath her 3 stores, 2 townhouses, a beach villa and a $1,000,000 bank account. If a boy is born, my legacy will be a couple of factories, and a $1,000,000 bank account. If it is twins, a factory and $500,000 each. However, if there is a miscarriage...\"  At this point, the father, who had remained silent all this time, places a hand firmly on the man's shoulder and tells him:  \"You'll screw her again!!!\""},{"joke_id":"SS881","USF1000_rating":7.0,"USF1001_rating":5.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"881","jokeText":"Two old pensioners are taking a trip down memory lane by going back to the place where they first met. \n\nSitting at a café, the little old man says, \"Remember the first time I met you over 50 years ago? We left this cafe, went round the corner behind the gas works, and I gave you one from behind.\" \n\n\"Why, yes, I remember it well, dear,\" replies the little old lady with a grin. \n\n\"Well, for old time's sake, let's go there again. and I'll give you one from behind.\" \n\nThe two pensioners pay their bill and leave the cafe. A young man sitting next to them has overheard the conversation and smiles to himself, thinking it would be quite amusing to see two old pensioners at it. He gets up and follows them. Sure enough, he sees the two pensioners near the gas works. The little old lady pulls off her knickers and lifts up her dress. \n\nThe old man pulls down his pants and grabs the lady's hips, and the little old lady reaches for the fence. Well, what follows is 40 minutes of the most athletic sex the man has ever seen. The little old man is banging away at the little old woman at a pace that can only be described as phenomenal. Limbs are flying everywhere, the movement is a blur, and they do not stop for a single second. Finally, they collapse and don't move for an hour. \n\nWell, the man is stunned. Never in his life has he ever seen anything that equates to this -- not in the movies, not from his friends, not from his own experiences. \n\nReflecting on what he has just seen, he says to himself, \"I have to know his secret. If only I could shag like that now, let alone in 50 years' time!\" \n\nThe two old pensioners have by this time recovered and dressed themselves. Plucking up courage, the man approaches the pensioner. \n\nHe says, \"Sir, in all my life I have never seen anybody shag like that, particularly at your age. What's your secret? Could you shag like that 50 years ago?\" \n\nThe pensioner replies, \"Son, 50 years ago, that goddamn fence wasn't electrified.\""},{"joke_id":"SS1401","USF1000_rating":4.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1401","jokeText":"Yo mama is so ugly that she stuck her head out the window,and got arrested for disturbing the peace."},{"joke_id":"SS950","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"950","jokeText":"A man walks into a bar one night.  He goes up to the bar and asks for a \nbeer.  \n\"Certainly, sir, that'll be 1 cent.\" \n\"ONE CENT!\" exclaimed the guy; the barman replied, \"Yes.\" \nSo the guy glances over at the menu, and he asks, \"Could I have a nice juicy T-bone steak, with chips, peas, and a fried egg?\"\n\"Certainly sir,\" replies the bartender, but all that comes to real money.\" How much money?\" inquires the guy. \"4 cents\", he replies.  \"FOUR cents!\" exclaims the guy.\n\"Where's the Guy who owns this place?\" \nThe barman replies, \"Upstairs with my wife.\" \nThe guy says, \"What's he doing with your wife?\" \nThe bartender replies, \"Same as I'm doing to his business.\""},{"joke_id":"SS21","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"21","jokeText":"A blonde is terribly overweight, so her doctor puts her on a diet. \"I want you to eat regularly for 2 days, then skip a day, and repeat this procedure for 2 weeks. The next time I see you, you'll have lost at least 5 pounds.\" When the blonde returned, she shocked the doctor by losing nearly 20 pounds. \"Why, that's amazing!\" the doctor said, \"Did you follow my instructions?\" The blonde nodded, \"I'll tell you though, I thought I was going to drop dead that 3rd day.\" \"From hunger, you mean?\", asked the doctor.\" \"No, from all that skipping.\""},{"joke_id":"SS3614","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3614","jokeText":"A kindergarten teacher was observing her classroom of children while they drew.  She would occasionally walk around to see each child's artwork. As she got to one little girl who was working diligently, she asked what the drawing was.\n\nThe girl replied, \"I'm drawing God.\"\n\nThe teacher paused and said, \"but no one knows what God looks like.\"\n\nWithout missing a beat, or looking up from her drawing the girl replied, \"They will in a minute.\""},{"joke_id":"SS941","USF1000_rating":10.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"941","jokeText":"Things you'd really like to say at work\n01. I can see your point, but you're still full of crap. \n02. I don't know what your problem is, but I'll bet it's hard to pronouce. \n03. I see you've set aside this special time to humiliate yourself in public. \n04. I'll try being nicer if you'll try being smarter. \n05. Ahh...I see the screw-up fairy has visited us again. \n06. I like you. You remind me of when I was young and stupid. \n07. I'm already visualizing the duct tape over your mouth. \n08. The fact that no one understands you doesn't mean you're an artist. \n09. What am I? Flypaper for freaks!? \n10. And your cry-baby whiny-assed opinion would be...? \n11. This isn't and office. It's Hell with fluorescent lighting. \n12. If I throw a stick, will you leave? \n13. Whatever kind of look you were going for, you missed. \n14. Can I trade this job for what's behind door #1? \n15. Chaos, panic, & disorder - my work here is done."},{"joke_id":"SS2771","USF1000_rating":9.0,"USF1001_rating":5.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2771","jokeText":"Q: How many Field Service Engineers does it take to replace a dead light bulb?\nA: Who can tell. Field Service Engineers are always in the dark.\nA: 2. One to hold the bulb and one to pound it in (etc)"},{"joke_id":"SS1365","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1365","jokeText":"Yo mamma so dumb she sold her car for gasoline money."},{"joke_id":"SS570","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"570","jokeText":"A woman gets home, schreeches her car into the driveway, runs into the house, slams the door and shouts at the top of her lungs, \"Honey, pack your bags. I won the damn lottery!\" The husband says, \"Ohmigod! What should I pack, beach stuff or mountain stuff?\" The wife yells back, \"I couldn't care less... just get the hell out!\""},{"joke_id":"SS431","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"431","jokeText":"The psychology instructor had just finished a lecture on mental health and was giving an oral test.\n\nSpeaking specifically about manic depression, she asked, \"How would you diagnose a patient who walks back and forth screaming at the top of his lungs one minute, then sits in a chair weeping uncontrollably the next?\"\n\nA young man in the rear raised his hand and answered, \"A basketball coach?\""},{"joke_id":"SS1460","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1460","jokeText":"Your mama is so fat, she fell in love and broke it.Your house is so small, I put the key in the keyhole and I killed three people."},{"joke_id":"SS1877","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1877","jokeText":"During the height of the cold war, the Americans and the Russians realized that if they continued their arms race, they were going to blow up the whole planet.They arranged a top secret summit, where it was decided to settle the whole dispute with one dog fight. They agreed to give each other5 years to breed the two most powerful fighting dogs ever.The winning dog's country would be entitled to dominate the world. The losing side would have to submit and lay down its arms.The Russians searched their vast country to find the meanest, most vicious Doberman and Rottweiler breeds and crossed them with the biggest, most dangerous Siberian wolves.They selected only the biggest and strongest puppy from each litter and fed it a diet of steroids and trained them to be lethal attack dogs. After five years of fierce breeding, Russiahad managed to create the biggest, most vicious dog the world had ever seen.Finally Russia and America met in Switzerland to let their dogs fight for world domination. Although its cage had 4-inch-thick reinforced steel-bars, everyone was afraid to even go near the Russian monster-dog. When the Russians saw the American dog, they burst into laughter. America had sent a weird looking 9-foot-long Dachshund! The Russian breeders felt a little sorry for the Dachshund, because they knew it didn't have the slightest chance to last even 10 seconds against Russia's killer.When the bell announced the beginning of the fight, the Russian dog leaped out of its cage, snarled, and charged the American Dachshund.The Dachshund slowly waddled out of its cage towards the Russian dog. But just when the Russian champion looked like it was going to bite the Dachshund's neck, the Dachshund opened its mouth and swallowed the Russian dog with one bite. The Russian monster was gone!The Russian politicians, shaking their heads in disbelief, walked over to the cheering Americans and said: \"We don\u0091t understand how this could have happened. We had our best breeders working for five years with the meanest Doberman and Rottweiler breeds in the world and the biggest, meanest Siberian wolves!\"\"That's nothing,\" an American replied. \"We had our best plastic surgeons working for five years to make an alligator look like a Dachshund.\""},{"joke_id":"SS2382","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2382","jokeText":"Jack was going to be married to Jill, so his father sat him down for a little fireside chat. \nHe said, \"Jack, let me tell you something. On my wedding night in our honeymoon suite, I took off my trousers and handed them to your mother, and said, 'Here - try these on.' So, she did, and said, 'These are too big,I can't wear them.'So I replied, 'Exactly. I wear the trousers in this family, and I always will.'Ever since that night, we have never had any problems.\" \n\"Hmmm,\" said Jack. He thought that might be a good thing to try, so on his honeymoon, Jack took off his trousers and said to Jill, \"Here, try these on.\"\nSo she did and said, \"These are too large, they don't fit me.\" So Jack said,\"Exactly. I wear the trousers in this family, and I always will, and I don't want you to ever forget that.\"\nThen Jill took off her knickers and handed them to Jack and said, \"Here, you try on mine. \"So he did, and said, \"I can't get into your pants.\" So Jill said, \"Exactly. And if you don't change your attitude, you never will.\""},{"joke_id":"SS507","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"507","jokeText":"A young couple, married just a couple of weeks, returns from their honeymoon to face the beginning of their new lives.The next morning the husband wakes up, showers, dresses and makes his way to the kitchen where he sees his new wife crying. So the husband inquires, \"What's wrong, Honey?\"\"Well, I came down here this morning to surprise you with a big breakfast, but I can't cook or clean.\" The husband smiles his biggest smile and says, \"There, there sweetie! I don't care that you can't cook and clean. Come on up to the bedroom and I'll show you what I'd like for breakfast.\" So off they went to the bedroom.That afternoon, the husband comes home for lunch to find his new wife crying again in the kitchen. \"What's wrong now, Sweetie?\" \"Well, the same thing as this morning. I came in here to make you something for lunch and I just can't cook.\" Again the husband smiles and says, \"Why don't you come back up to the bedroom and I'll have my lunch there!\" So off they went to the bedroom again. That evening the new husband comes home, walks in the house and sees his new bride naked sliding down the banister of the stairs. Up she runs, and WHOOSH down the banister. After the third trip the husband asks, \"What are you doing, Honey?\" \"Warming up your supper!\" she replies."},{"joke_id":"SS2942","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2942","jokeText":"A young man was walking through a super-market to pick up a few things when he noticed an old lady following him.\n\n\"Excuse me,\" he said. \"Can I help you?\"\n\n\"Oh, Pardon me,\" the old woman replied. \"I'm sorry if my staring has made you uncomfortable. But you look just like my son. He died recently and I never got to say goodbye.\"\n\n\"I'm very sorry,\" replied the young man. \"Is there anything I can do for you?\"\n\n\"Yes,\" she said, \"as I'm leaving, would you say 'Goodbye, mother?' It would make me feel so much better.\"\n\n\"Sure,\" answered the young man. As the old woman was leaving, he called out, \"Goodbye, Mother!\"\n\nThen, as he stepped up to the checkout counter, he saw that his total was nearly $200.\n\n\"How can that be?\" he asked. \"I only purchased a few things!\"\n\nThe clerk replied, \"Your mother said you'd pay for her.\""},{"joke_id":"SS1342","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1342","jokeText":"A little boy goes to his dad and asks, \"What's politics?\"  Dad says, \" Well son, let me try to explain it this way:  I'm the breadwinner of the family, so let's call me Capitalism. Your Mom, she's the administrator of the money, so we'll call her the Government. We're here to take care of your needs so we'll call you the People. The nanny, we'll consider her he Working Class. Now your baby brother, we'll call him the Future. Now, think about that and see if that makes sense.\"  So the little boy goes off to bed thinking about what Dad has said. Later that night, he hears his baby brother crying, so he gets up to check on him, he finds that the baby has severely soiled his diaper. So the little boy goes to is parent's room and finds his mother fast asleep. Not wanting to wake her, he goes to the nanny's room. Finding the door locked, he peeks in the keyhole and sees his father in bed with the nanny. He gives up and goes back to bed.  The next morning, the little boy says to to his father \" I think I understand Politics now.\" The father replies, \"Good son, tell me in your own words what you think it is.\" The boy promptly answers, \"Well, while Capitalism is screwing the Working Class, the Government is asleep, the People are being ignored, and the Future is in deep trouble.\""},{"joke_id":"SS2566","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2566","jokeText":"A large two engine train was crossing America. After they had gone\nsome distance one of the engines broke down.\n\n\"No problem,\" the engineer thought, and carried on at half-power.\nFurther on down the line, the other engine broke down, and the train\ncame to a standstill.\n\nThe engineer decided he should inform the passengers about why the\ntrain had stopped, and made the following announcement:\n\n\"Ladies and gentlemen, I have some good news and some bad news. The\nbad news is that both engines have failed, and we will be stuck here\nfor some time. The good news is that this is a train and not a\nplane.\""},{"joke_id":"SS2914","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2914","jokeText":"This guy suspects his wife is cheating on him. He comes home early and she meets him at the door in a bathrobe, her hair a mess. \"Where is he?\" he shouts. \"Where's the guy who's been sleeping with you?\" \"I don't know what you're talking about\" she says so he tears the house apart looking for this guy. Finally he's on the second floor, in the kitchen, he looks out the window and sees some guy sitting in a Volkswagen. \"Aha!\" he thinks, \"That's the guy who's been sleeping with my wife.\" He's so furious he picks up the refrigerator, throws it out the window at the guy, has a heart attack and dies.\n\nSo St. Peter meets him at the gates of Heaven and asks \"What are you doing here?\" The guy says \"Well, I knew my wife was cheating on me so I came home early from work, saw him sitting in his Volkswagen out on the street, threw the refrigerator at him, I had a heart attack and died.\" St. Peter says \"You don't belong here; go to Hell.\" He pulls a big lever, a trap door opens up and the guy disappears.\n\nA few minutes later another guy comes up to St. Peter at the gates of Heaven. St. Peter asks \"What are you doing here?\" The guy says \"I don't know! I was just sitting in my Volkswagen, minding my own business, when suddenly somebody throws a refrigerator at me.\" St. Peter wags his finger and says \"I heard about you... you go to Hell too.\" He pulls the lever and the guy disappears.\n\nA few minutes later another guy comes up to St. Peter at the gates of Heaven. St. Peter asks \"What are you doing here?\" The guy says \"I don't know! I was just sitting in a refrigerator, minding my own business...\""},{"joke_id":"SS1774","USF1000_rating":8.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1774","jokeText":"The elderly Italian man went to his parish priest, and asked if the priest would hear his confession.\"Of course, my son,\" said the priest.\"Well, Father, at the beginning of World War Two, a beautiful woman knocked on my door and asked me to hide her from the Germans. I hid her in my attic, and they never found her.\"\"That's a wonderful thing, my son, and nothing that you need to confess,\" said the priest.\"It's worse, Father. I was weak, and told her that she had to pay for rent of the attic with her sexual favors,\" continued the old man.\"Well, it was a very difficult time, and you took a large risk - you would have suffered terribly at their hands if the Germans had found you hiding her. I know that God, in his wisdom and mercy, will balance the good and the evil, and judge you kindly,\" said the priest.\"Thanks, Father,\" said the old man.\"That's a load off of my mind. Can I ask another question?\"\"Of course,my son,\" said the priest.The old man asked, \"Do I need to tell her that the war is over?\""},{"joke_id":"SS1871","USF1000_rating":7.0,"USF1001_rating":7.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1871","jokeText":"Catholic MathLittle Tommy was ding very badly in math. His parents had tried everything; flash cards, special learning centers, in short, everything they could think of. Finally in a last dash effort, they took Tommy down and enrolled him in the local Catholic school.After the first day, little Tommy comes home with a very serious look on his face. He doesn't kiss his mother hello. Instead, he goes straight to his room and starts studying. Books and papers are spread out all over the room and little Tommy is hard at work. His mother is amazed.She calls him down to dinner and the her shock, the minute he is done he marches back to his room without a word and in no time he is back hitting the books as hard as before.This goes on for sometime, day after day while the mother tries to understand what made all the difference. Finally, little Tommy brings home his report card. He quietly lays it on the table and goes up to his room and hits the books. With great tredpidation, his mom looks at it and to her surprise, little Tommy got an A in math.She can no longer hold her curiosity. She goes to his room and says, Son, what was it?Was it the nuns?Little Tommy looks at her and shakes his head.Well then, she replies, was it the books, the discipline, the structure, the uniforms, WHAT was it?Little Tommy looks at her and says, Well, on the first day of school, when I saw that guy nailed to the plus sign, I knew they wern't fooling around."},{"joke_id":"SS2824","USF1000_rating":6.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2824","jokeText":"Q: How many ''pro-lifers'' does it take to change a light bulb?\nA: 6: 2 to screw in the bulb and 4 to testify that it was lit from the moment they began screwing."},{"joke_id":"SS638","USF1000_rating":9.0,"USF1001_rating":7.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"638","jokeText":"A 54 year old accountant leaves a letter for his wife one Friday evening that reads: Dear Wife (that's what he called her): I am 54 and by the time you receive this letter I will be at the Grand Hotel with my beautiful and sexy 18 year old secretary. When he arrived at the hotel there was a letter waiting for him that read as follows: Dear Husband (that's what she called him): I too am 54 and by the time you receive this letter I will be at the Breakwater Hotel with my handsome and virile 18 year old toy boy. You being an accountant will therefore appreciate that 18 goes into 54 many more times than 54 goes into 18."},{"joke_id":"SS1076","USF1000_rating":8.0,"USF1001_rating":8.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1076","jokeText":"The Shortest Books Ever Written* 1000 Years of German Humor* Everything men know about women* The Code of Ethics for Lawyers* Italian War Heroes* Who's who in Puerto Rico* Americans' Guide to Etiquette* Royal Family's Guide to Good Marriages* Safe Places to Travel in the USA* Jerry Garcia's Guide to Beating Drug Addiction* Contraception by Pope John Paul II* Career Opportunities for Liberal Arts Majors* Cooking Gourmet Dishes With Tofu* Gun Control for The New Millenium: NRA Handbook"},{"joke_id":"SS1246","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1246","jokeText":"The devil visited a lawyer's office and made him an offer. \"I can arrange some things for you, \" the devil said. \"I'll increase your income five-fold. Your partners will love you; your clients will respect you; you'll have four months of vacation each year and live to be a hundred. All I require in return is that your wife's soul, your children's souls, and their children's souls rot in hell for eternity.\"The lawyer thought for a moment and asked, \"What's the catch?\"."},{"joke_id":"SS393","USF1000_rating":5.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"393","jokeText":"An Irishman in a wheelchair rolls into a bar and asks the waitress for a cup of coffee.  He then looks over at the bar and asks the waitress, \"Is that Jesus?\"  The waitress says that it is, so the Irishman says, \"Give him a cup of coffee... I'll pay.\" A few minutes later, an Englishman with a humped back walks in and asks the waitress for a cup of tea.  He then asks the waitress, \"Hey... is that Jesus over there?\"  The waitress nods and so the Englishman says, \"Give 'im a cup of tea... on me.\" A few minutes later, a Redneck walks in on a pair of crutches.  He says, \"Hey, sweet thang... how's 'bout an ice-cold coke.  Holy smokes... is that Jesus?\"  The waitress says, \"Sure is.\"  So, the Redneck says, \"Give the ol' boy a coke... put it on my tab.\"  Later, Jesus gets up to leave, walks over to the Irishman, touches him and says, \"For your kindness, you are healed.\"  The Irishman gets up out of his wheelchair and dances a jig out of the door.  Jesus walks over to the Englishman, touches him and says, \"For your kindness, you are healed.\"  The Englishman stretches out his back and does backflips out the door.  Jesus walks over to the Redneck.  Then, the Redneck gets up, backs away, and says, \"Stay away from me... I'm drawin' disability!\""},{"joke_id":"SS523","USF1000_rating":7.0,"USF1001_rating":5.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"523","jokeText":"This guy had a very attractive wife, who was always wanting clothes, jewelry, etc., but he was not too well off. One day his wife came home with a diamond neckless. The guy asked: \"Where did you get that?\" His wife replied: \"I won it at bingo.\" The next night she came home with a mink coat. The guy asked: \"Where did you get that?\" His wife replied: \"I won it at bingo.\" The next night she came home with a Mercedes Benz. The guy asked: \"Where did you get that?\" His wife replied: \"I won it at bingo. Please go upstairs and run my bath for me.\" His wife came upstairs to find a very small amount of water in the tub. The wife asked: \"How come you put so little water in the tub?\" The guy replied: \"I didn't want you to wet your bingo card\"."},{"joke_id":"SS2605","USF1000_rating":4.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2605","jokeText":"Two men were boasting to each other about their old army days.\n\n\"Why, my outfit was so well drilled,\" declared one, \"that when they presented arms all you could hear was slap, slap, click.\"\n\n\"Very good,\" conceded the other, \"but when my company presented arms you'd just hear slap, slap, jingle.\"\n\n\"What was the jingle?\" asked the first. \"Oh,\" replied the other offhand, \"just our medals.\""},{"joke_id":"SS1651","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1651","jokeText":"You are so dishonest that I can't even be sure that what you tell me are lies!"},{"joke_id":"SS288","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"288","jokeText":"The ten things a guy knows about a girl:\n\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10. They have breasts."},{"joke_id":"SS2827","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2827","jokeText":"Q: How many Harvard grads does it take to screw in a light bulb?\nA: Just one. He grabs the bulb and waits for the world to revolve around him."},{"joke_id":"SS2598","USF1000_rating":10.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2598","jokeText":"You've all heard of the Air Force's ultra-high-security, super-secret base in Nevada, known simply as \"Area 51?\"\n\nWell, late one afternoon, the Air Force folks out at Area 51 were very surprised to see a Cessna landing at their \"secret\" base. They immediately impounded the aircraft and hauled the pilot into an interrogation room.\n\nThe pilot's story was that he took off from Vegas, got lost, and spotted the Base just as he was about to run out of fuel. The Air Force started a full FBI background check on the pilot and held him overnight during the investigation.\n\nBy the next day, they were finally convinced that the pilot really was lost and wasn't a spy. They gassed up his airplane, gave him a terrifying \"you-did-not-see-a-base\" briefing, complete with threats of spending the rest of his life in prison, told him Vegas was that-a-way on such-and-such a heading, and sent him on his way.\n\nThe day after that though, to the total disbelief of the Air Force, the same Cessna showed up again. Once again, the MP's surrounded the plane...only this time there were two people in the plane.\n\nThe same pilot jumped out and said, \"Do anything you want to me, but my wife is in the plane and you have to tell her where I was last night!\""},{"joke_id":"SS1003","USF1000_rating":9.0,"USF1001_rating":5.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1003","jokeText":"A teacher just taught her class how to describe stuff, using colors and size. She then decides to play a guessing game with them. She asks, \"what fruit is red both on the inside and the outside?\" A very smart little boy by the name of Johnny, jumped up and answers, \"it's a strawberry.\" The teacher replied, \"no dear, but you're thinking, you're thinking.\"She then asks, \"what is yellow on the inside and sometimes yellow and green on the outside?\" The same little boy jumps up and shouts, \"an orange.\" The teacher smiled patiently and said, \"no Johnny, but you're thinking, you're thinking.\"She then offered them the chance to quiz her. Again, Johnny hollers out and asks, \"what is long, brown, has a red head and in my pants?\"Apalled by his question, she sent him to the corner. He then looked at her and said, \"no miss, it's my pencil, but you're thinking, you're thinking!\""},{"joke_id":"SS1500","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1500","jokeText":"If we were to kill everybody who hates you, it wouldn't be murder; it would be genocide!"},{"joke_id":"SS2784","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2784","jokeText":"Q: How many Marxists does it take to screw in a light bulb?\nA: None: The light bulb contains the seeds of its own revolution."},{"joke_id":"SS417","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"417","jokeText":"Little Johnny, Billy and Tommy were walking home from school one warm spring day. As they were cutting through the alleys and backyards, they happened to look through a hole in the fence of one of the yards where a woman was sunbathing in the nude. As they looked through the hole, Johnny suddenly started to scream, left his friends and took off running for home. The next day, as the three boys came home again, they found the same hole in the fence and started to watch the woman. Again, after just a few minutes, Johnney started screaming and ran off quickly. On the third day, the boys were peeping into the hole in the fence again after school, when Johnny turned around and started to run again. But this time, Bill and Tommy grabbed him and demanded to know what was wrong. Johnny replied, \"My mother told me that if I ever looked at a naked woman, I would turn to stone... And I started to feel a part of me getting awfully hard    \""},{"joke_id":"SS961","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"961","jokeText":"With Sam dying, his wife Carol was maintaining a candlelight vigil by his side. She held his fragile hand praying and crying, this roused him from his slumber.He looked up and his pale lips said...\"my darling Carol.\"\"Hush, my love\"...she said... \"rest, don't talk.\"In his tired voice...\"I have something I must confess to you.\"\"There's nothing to confess\"...replied the weeping Carol...\"everything is all right, just go to sleep.\"\"No\"...he struggles...\"I must die in peace, I have something to tell you Carol...I cheated on you!\"\"I know\"...Carol whispered as she softly stroked his forehead...\"just let the poison do it's job.\""},{"joke_id":"SS598","USF1000_rating":10.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"598","jokeText":"A woman is in bed with her lover, who also happens to be her husband’s best friend. They make love for hours, and afterwards, while they’re just lying there, the phone rings. Since it’s the woman’s house, she picks up the receiver.Her lover looks over at her and listens, only hearing her side of the conversation. “Hello? Oh, hi. I’m so glad that you called. Really? That’s wonderful. I am so happy for you. That sounds terrific. Great! Thanks. Okay. Bye, bye.” She hangs up the phone and her lover asks, “Who was that?” “Oh” she replies, “That was my husband telling me all about the wonderful time he’s having on his fishing trip with YOU!”"},{"joke_id":"SS716","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"716","jokeText":"An elderly man and his wife decided to separate.  Before beingallowed to do so legally, the Family Court insisted they undergo somecounselling from the marriage guidance mob, to see if their union could besaved. The counsellor did her best, but to no avail. The old folk were absolutely determined to go through with separation leading to divorce.Finally, in some desperation, the counsellor said:  \"But you're 95 and your wife is 93.  You've been married for 72 years!  Why do you want to separate now??\" To which the wife replied:  \"We haven't been able to stand each other for the last 46 years. But we thought we should wait until all the children died before we split up.\""},{"joke_id":"SS2653","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2653","jokeText":"A group of tourists was being guided through an ancient castle in\nEurope. \"This place,\" the guide told them, \"is 600 years old.\"\n\nThere were appreciative murmurs from the crowd.\n\n\"Not a stone in it has been touched,\" the guide continued, \"nothing\naltered, nothing replaced in all those years.\"\n\n\"Wow,\" piped up one woman from the rear of the group. \"They must have\nthe same landlord I do.\""},{"joke_id":"SS2476","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2476","jokeText":"A little boy walked in on his mom and dad having sex and the mom was jumpin all over the dad.So the next day the little boy asks his mom what she was doing. She replies with \"Honey, I was jumping because Daddy is fat and needs to lose weight.\"The little boy said \"But Mommy, that won't work because every morning the lady next door comes over and blows him back up!\""},{"joke_id":"SS1292","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1292","jokeText":"A Marine colonel on his way home from work at the Pentagon came to a dead halt in traffic and thought to himself, \"Wow, this traffic seems worse than usual. Nothing's even moving.\"He notices a police officer walking back and forth between the lines of cars so he rolls down his window and asks, \"Excuse me, Officer, what's the hold up?\"The Officer replies, \"President Bush is just so depressed about being behind in the polls that he stopped his motorcadein the middle of the Beltway and he's threatening to douse himself in gasoline and set himself on fire. He says he can't find donators to give him money for his campaign. I'm walking around taking up a collection for him.\"\"Oh really? How much have you collected so far?\"\"So far only about three hundred gallons, but I've got a lot of folks still siphoning!\""},{"joke_id":"SS3354","USF1000_rating":7.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3354","jokeText":"From:  The White House\nTo:    Albert Gore, Jr.\n\nDear Al:\n\nWe found some more votes.  You won!\n\nWhen do you want to take over?\n\n\nSincerely,\n\nGeorge W. Bush"},{"joke_id":"SS600","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"600","jokeText":"Whats the difference between a womans paycheck and her periods?Well...:They come once a month,They get her stressed,And if one don't come...SHES IN TROUBLE."},{"joke_id":"SS1012","USF1000_rating":8.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1012","jokeText":"The new company recruit was lazy. One morning he dialed the number\nof the cafeteria, but got the wrong number...\n\nWhen someone picked the phone he said, \"I'm don't feel like working\ntoday. Can you send up a coffee and a muffin, and I'll just sit\naround and read the paper?\"\n\n\"Do you know whom you are talking to?\" the other side asked.\n\n\"No.\" he replied.\n\n\"You are talking to the director of this company!\" the other side\nreplied.\n\nThen our friend asked, \"do you know who is talking on this side?\"\n\n\"No.\" the director replied.\n\n\"Good.\" And he put the phone down."},{"joke_id":"SS1097","USF1000_rating":7.0,"USF1001_rating":7.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"1097","jokeText":"This guy walks into a bar and ask the bar tender for a drink.  He gets his drink and minds his own business and looks up and down the bar.  To his amazement, he is stunned to see a 10' pianist on top of the bar.  \"Hey bartender,\" he says...\"What is that 10' pianist doing on top of your bar?\"  \"Well, you see this lamp?\" asks the bartender.  \"Rub this lamp and you can make a wish, and you will see why I have a 10' pianist on the bar.\"  So the man rubs the lamp and he wishes for a million bucks.  All of a sudden, the doors pop open and a million ducks come flying into the bar.  \"Hey wait a minute!\" says the man.  \"I wished for a million bucks not a million ducks.\"  The bartender looks at him and says...\"I didn't want a 10' pianist either.\""},{"joke_id":"SS871","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"871","jokeText":"A guy and his wife enter the hospital and explain to the doctors that she is about to give birth. They take her into a room and a few minutes later, the doctor comes out and tells the guy, \"Your baby is OK but it looks like he'll be born without a leg.\" He goes back into the room and about 20 minutes later he comes back out and says to the guy, \"I have bad news, the baby is gonna be born with no legs, no arms and no nose.\" The guy is very upset but says, \"At least he's alive.\" The doctor goes back into the room. The guy is getting impatient and after about an hour the doctor hears the guy calling him. The doctor back out and says to the guy, \"I have very bad news, the baby is just an ear.\" The guy, who is distraught by now, says almost jokingly, \"At least it couldn't get any worse.\" The doctor then says, \"Yes it can, he's also deaf."},{"joke_id":"SS3","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3","jokeText":"One day this cop pulls over a blonde for speeding. The cop gets out of his car and asks the blonde for her license.''You cops should get it together. One day you take away my license and the next day you ask me to show it.''"},{"joke_id":"SS4","USF1000_rating":6.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"4","jokeText":"Three women are about to be executed for crimes. One's a brunette, one's a redhead, and one's a blonde.Two guards brings the brunette forward, and the executioner asks if she has any last requests. She says no, and the executioner shouts, \"Ready . . . Aim . . .\"Suddenly the brunette yells, \"earthquake!!\" Everyone is startled and looks around. She manages to escape.The angry guards then bring the redhead forward, and the executioner asks if she has any last requests. She says no, and the executioner shouts, \"Ready . . . Aim . . .\"The redhead then screams, \"tornado!!\" Yet again, everyone is startled and looks around. She too escapes execution.By this point, the blonde had figured out what the others did. The guards bring her forward, and the executioner asks if she has any last requests. She also says no, and the executioner shouts, Ready . . . Aim . . .\"The blonde shouts, \"fire!!\""},{"joke_id":"SS3473","USF1000_rating":8.0,"USF1001_rating":3.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"3473","jokeText":"AMES, IA--The heaviest element known to science was recently discovered by materials researchers at IPRT\/ISU. The new element, tentatively named Administratium, has no protons or electrons, and thus has an atomic weight of 0. However, it does have one neuron, 125 assistant neutrons, 75 vice neutrons, and 111 assistant vice neutrons. This gives it an atomic mass of 312. These 312 particles are held together in a nucleus by a force that involves the continuous exchange of particles called morons.\n\nSince it has no electrons, Administratium is totally inert. However, it can be detected chemically, since it impedes every reaction it comes into contact with. According to its discovers, a tiny amount of Administratium caused one reaction to take over four days to complete; the normal reaction time is less than one second.\n\nAdministratium has a normal half life of approximately three years, at which time it does not actually decay, but instead undergoes a reorganization in which neutrons, vice neutrons, and assistant vice neutrons exchange places. Studies have shown that the atomic mass usually increases after each reorganization.\n\nResearch at other laboratories indicates that Administratium occurs naturally in the atmosphere. It tends to concentrate at certain points, such as governmental agencies, large corporations, and universities. It is always found in the newest, best appointed, and best maintained buildings.\n\nScientists point out that Administratium is known to be toxic at any level of concentration and can easily destroy any productive reactions where it is allowed to accumulate. Attempts are being made to determine how Administratium can be controlled to prevent irreversible damage, but results to date are not promising."},{"joke_id":"SS640","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"640","jokeText":"The lookout aboard a clipper ship spots a pirate ship approaching, and yells down to the captain. The captain orders the bosun to bring his red shirt. The captain puts on his red shirt, and successfully leads his crew in fighting off the pirates. The next day, the lookout spots TWO pirate ships approaching. He yells to the captain, who again orders the bosun to bring his red shirt. The captain again wears the red shirt as they successfully repel the pirates. After the battle the bosun asks, \"Captain, why do you always wear the red shirt in battle?\" The captain replies, \"Because, if I am wounded, the crew will not see the blood and lose their courage.\" The next day the lookout spots SIX pirate ships approaching and yells to the captain. Anticipating the order, the bosun immediately brings the red shirt. \"To heck with that!\" says the captain. \"Bring me my brown pants!\""},{"joke_id":"SS2794","USF1000_rating":5.0,"USF1001_rating":4.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2794","jokeText":"Q: How many 'Cliffie girls does it take to change a light bulb?\nA: It's ''Radcliffe Women'' and it's not funny!"},{"joke_id":"SS1466","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":8.0,"source":"stupidstuff","datasource_joke_id":"1466","jokeText":"Yo Mama so fat that she  has to use a VCR as a pager."},{"joke_id":"SS2254","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"2254","jokeText":"An old guy goes to the doctor and gets some tests done. The doctor comes back from checking the results and says,\n\"I have some bad news. You have cancer and you have Alzheimer's.\"\nThe old man replies \"Oh thank god I don't have cancer!\""},{"joke_id":"SS120","USF1000_rating":9.0,"USF1001_rating":7.0,"USF1002_rating":5.0,"source":"stupidstuff","datasource_joke_id":"120","jokeText":"1.  Capmbell's Soup Condoms: Mmm, mmmm, good...2. Coca Cola Conddoms: the real thing.3. Diet pepsi Condoms: You got the right one, baby.4. Double Mint: Double your pleasure, Double your fun!5. Energizer: It keeps going and going and going...6. Ford condoms: the best never Rest.7. Hewlett Packard Condoms; Expanding possibilities.8. KFC Condoms: Finger-lickin good.9. M&M Condom: It melts in your mouth, not in your hands!10. Mars Bar condoms: The quicker picker upper!11. Maxwell House: good to the last drop!12. Microsoft: Where do you want to go today?13. Nike Condoms: just do it.14. Pringles Condoms: Once you pop, you can't stop.15. Taco Bell: Get some; make a run for the border.16. Tattslotto Condoms: Who's next?17. Star Trek condoms: To boldly go where no man has gone before.18. Toyota Condoms: Oh what a feeling.19. United Airlines travel pack: Fly United.20. Yellow pages Condoms: Aren't you glad you use it? don't you wish everybody did?"},{"joke_id":"SS816","USF1000_rating":9.0,"USF1001_rating":10.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"816","jokeText":"A fireman is at the station house working outside on the fire truck when he notices a little girl next door. The little girl is in a little red wagon with little ladders hung off the side. She is wearing a fireman's hat and has the wagon tied to a dog. \n\nThe fireman says \"Hey little girl. What are you doing?\" \n\nThe little girl says \"I'm pretending to be a fireman and this is my fire truck!\" \n\nThe fireman walks over to take a closer look. \"Little girl that sure is a nice fire truck!\" the fireman says. \n\n\"Thanks mister\" says the little girl. \n\nThe fireman looks a little closer and notices the little girl has tied the dog to the wagon by its testicles. \n\n\"Little girl\", says the fireman, \"I don't want to tell you how to run your fire truck, but if you were to tie that rope around the dog's neck I think you could go faster.\" \n\nThe little girl says, \"You're probably right mister, but then I wouldn't have a siren!'"},{"joke_id":"SS554","USF1000_rating":7.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"554","jokeText":"A husband and wife were having an argument. Suddenly the husband picked up a bottle lying near him and threw it at his wife. The bottle missed the wife and got into the neighbours' house breaking the window glass.\nNow both the husband and wife got embarassed and went to apologise to the neighbour. Upon reaching the house, they found out a young man sitting on a couch with a smile on his face. Before the couple could say anything, the man said, \"I am a genie. I was enclosed in that bottle for many years, but you two have set me free, so ask for any three boons you want to and it shall be fulfilled. But against your three boons you will have to fulfill one wish of mine\". The couple were so happy that they didn't think twice and presented their wishes.\"I want millions of dollars in my account\", The husband said. \"Done\", said the genie.\"I want diamond jewelleries in all my vaults\". \"Done\", said the genie.\"I want bunglows all over the world\", said the husband.\"Done\", said the geniee.Now it was the time of the genies wish. \"So\" the genie said, \"I have fulfilled all the three wishes you have said, and its time for my wish. I have not slept with a women for long. I wish to have sex with your wife. The couple got worried, but the husband explained that it was only a genie and it didn't matter much to him. Besides the genie has given them a lot of things. So the wife consented. The geniee and the wife had a lovely night together. Finally in the morning the genie said, \"it was wonderful but how old is your husband?\"\"Why, he is just thirty five\"\"My god \", said the geniee, \"even at thirty five he still believes in geniees\"."},{"joke_id":"SS200","USF1000_rating":8.0,"USF1001_rating":10.0,"USF1002_rating":4.0,"source":"stupidstuff","datasource_joke_id":"200","jokeText":"A concerned husband went to a doctor to talk about his wife. He says to the doctor, \"Doctor, I think my wife is deaf because she never hears me the first time and always asks me to repeat things.\" \"Well,\" the doctor replied, \"go home and tonight stand about 15 feet from her and say something to her. If she doesn't reply move about 5 feet close and say itagain. Keep doing this so that we'll get an idea about the severity of her deafness\". Sure enough, the husband goes home and does exactly as instructed. He starts off about 15 feet from his wife in the kitchen as she is chopping some vegetables and says, \"Honey, what's for dinner?\" He hears no response. He moves about 5 feet closer and asks again. No reply. He moves 5 feet closer. Still no reply. He gets fed up and moves right behind her, about an inch away, and asks again, \"Honey, what's for dinner?\" She replies, \"For the fourth time, vegetable stew!\""},{"joke_id":"SS5","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"5","jokeText":"A girl came skipping home FROM school one day. \"Mommy, Mommy,\" she yelled, \"we were counting today, and all the other kids could only count to four, but I counted to 10. See? 1, 2, 3, 4, 5, 6,7, 8, 9, 10!\" \"Very good,\" said her mother. \"Is it because I'm blonde, Mommy?\" \"Yes, Honey, it's because you're blonde.\" The next day the girl came skipping home FROM school. \"Mommy, Mommy,\" She yelled, \"we were saying the alphabet today, and all the other kids could only say it to D, but I said it to G. See? A,b, c, d, e, f, g!\" \"Very good,\" said her mother. \"Is it because I'm blonde, Mommy?\" \"Yes, Honey, it's because you're blonde.\" The next day the girl came skipping home FROM school. \"Mommy, Mommy,\" she yelled, \"we were in gym class today, and when we showered, all the other girls had flat chests, but I have these!\" And she lifted her tank top to reveal a pair of 36Cs. \"Very good,\" said her embarrassed mother. \"Is it because I'm blonde, mommy?\" \"No, Honey, it's because you're 25.\""},{"joke_id":"SS6","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"6","jokeText":"An airline captain was helping a new blonde flight attendant prepare for her first overnight trip. Upon their arrival, the captain showed the flight attendant the best place for airline personnel to eat, shop and stay overnight. The next morning as the pilot was preparing the crew for the day's route, he noticed the new stewardess was missing. He knew which room she was in at the hotel and called her up to ask what happened to her. She answered the phone, crying, and said, \"I can't get out of the room!\" \"You can't get out of your room?\" the captain asked. \"Why not?\" She replied, \"There are only three doors in here,\" she sobbed, \"one is the bathroom, one is the closet, and one has a sign on it that says 'Do Not Disturb'!\""},{"joke_id":"SS7","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"7","jokeText":"A blonde and a brunette decided to rob a bank. They quickly devised a good plan and they put their plan to action. \nThe brunette drove up to the front of the bank that they had decided to rob. She turned to the blonde and asked her, \"Now, do you remember what the plan is?\" The blonde sighed and replied, \"Yeah, yeah, I remember...\" The brunette went over the plan once more and let the blonde out to do her stuff. \n\nBefore the blonde could shut the door, the brunette yelled out, \"Be sure to be in and out in no more than 5 minutes!\" The blonde ran inside and the brunette waited in the car... and waited... and waited... and waited... and waited. After waiting for so long in the car, the blonde bursts out of the bank's doors, the alarm blaring loud enough to wake everyone up. The blonde was lugging a bank safe behind her by a rope tied around it. A security guard ran out of the bank, his pants down around his ankles and attempting to reach his gun. The blonde breathed heavily as she tried to put the safe in the car but finally just gave up and dropped the safe behind. She ran into the passenger seat and pulled the door shut, the car already moving. The security guard yelled, \"Stop! Stop!\" while the pair drove off, leaving the safe with rope tied tightly around it behind. The brunette frantically asked the blonde, \"What the hell happened in there?!?\" The blonde was panting and turned to the brunette and choked out, \"What do you mean? I followed the plan exactly!\" \nThe brunette paused and yelled, \"YOU IDIOT! YOU WERE SUPPOSED TO TIE UP THE GUARD AND BLOW THE SAFE!\""},{"joke_id":"SS8","USF1000_rating":0.0,"USF1001_rating":0.0,"USF1002_rating":0.0,"source":"stupidstuff","datasource_joke_id":"8","jokeText":"A brunette, a redhead and a blonde walk into a bar. For the sake of brevity, each one orders her drink with an abbreviated code word. The brunette walks up to the bartender and says, \"Hey give me an ML.\" The bartender nods his head and hands her a Miller Lite. Following her, the redhead walks up to the bartender and says, \"I'd like a BL.\" Giving her a nod, the bartender pulls up a Bud Lite. Last, the blonde walks up to the bartender and says, \"Give me a Fifteen.\" \"A Fifteen?\" the bartender replies, \"What the hell is that?\" \"Oh, you know,\" the blonde says, \"A Seven and Seven.\""}]